{
  "itemGroup.astralsorcery": "星輝魔法",
  "itemGroup.astralsorcery.papers": "[AS]星圖",
  "itemGroup.astralsorcery.crystals": "[AS]共振水晶",

  "astralsorcery.command.argument.constellation.notfound": "找不到星座.",

  "death.attack.astralsorcery.stellar": "%1$s崩解成星塵",
  "death.attack.astralsorcery.bleed": "%1$s失血過多",

  "jei.category.astralsorcery.well": "聚星缸",
  "jei.category.astralsorcery.infuser": "星能聚合器",
  "jei.category.astralsorcery.interaction": "液體互動",
  "jei.category.astralsorcery.transmutation": "星輝轉化",
  "jei.category.astralsorcery.altar_attunement": "共鳴祭壇",
  "jei.category.astralsorcery.altar_constellation": "天輝祭壇",
  "jei.category.astralsorcery.altar_discovery": "星輝合成台",
  "jei.category.astralsorcery.altar_trait": "五彩祭壇",

  "jei.astralsorcery.tip.chance": "%s%%",

  "advancements.astralsorcery.attune_crystal.title": "開始共振",
  "advancements.astralsorcery.attune_crystal.desc": "將一個水晶石與星座進行共鳴",
  "advancements.astralsorcery.attune_self.title": "我看見光了",
  "advancements.astralsorcery.attune_self.desc": "將自身與一個高亮星座進行共鳴",
  "advancements.astralsorcery.attune_trait.title": "我們必須要更深入些",
  "advancements.astralsorcery.attune_trait.desc": "通過對共鳴水晶石進行微調以進一步修改其屬性",
  "advancements.astralsorcery.celestial_crystals.title": "手工打造,獨具匠心",
  "advancements.astralsorcery.celestial_crystals.desc": "通過天體水晶簇獲得一個天體水晶石",
  "advancements.astralsorcery.craft_t2_altar.title": "升級完成",
  "advancements.astralsorcery.craft_t2_altar.desc": "將星輝合成台升級為星輝祭壇",
  "advancements.astralsorcery.craft_t3_altar.title": "雁過留痕",
  "advancements.astralsorcery.craft_t3_altar.desc": "合成天輝祭壇",
  "advancements.astralsorcery.craft_t4_altar.title": "我要飛得更高",
  "advancements.astralsorcery.craft_t4_altar.desc": "合成五彩祭壇",
  "advancements.astralsorcery.find_constellation.title": "我看見你了",
  "advancements.astralsorcery.find_constellation.desc": "用望遠鏡觀測一個明亮的星座",
  "advancements.astralsorcery.find_minor_constellation.title": "有人在嗎",
  "advancements.astralsorcery.find_minor_constellation.desc": "用瞭望台觀測一個朦朧的星座",
  "advancements.astralsorcery.find_weak_constellation.title": "有時要瞇起眼",
  "advancements.astralsorcery.find_weak_constellation.desc": "用天文望遠鏡觀測一個暗淡的星座",
  "advancements.astralsorcery.perk_level_large.title": "物是人非",
  "advancements.astralsorcery.perk_level_large.desc": "將你的星能力修煉到最高等級",
  "advancements.astralsorcery.perk_level_medium.title": "長夜漫漫",
  "advancements.astralsorcery.perk_level_medium.desc": "將你的星能力修煉到25級",
  "advancements.astralsorcery.perk_level_small.title": "這只是開始",
  "advancements.astralsorcery.perk_level_small.desc": "將你的星能力修煉到10級",
  "advancements.astralsorcery.rock_crystals.title": "這值多少錢?",
  "advancements.astralsorcery.rock_crystals.desc": "獲得一個水晶石",
  "advancements.astralsorcery.root.title": "星輝魔法",
  "advancements.astralsorcery.root.desc": "光的掌控",

  "potion.potency.6": "VII",
  "potion.potency.7": "VIII",
  "potion.potency.8": "IX",
  "potion.potency.9": "X",
  "potion.astralsorcery.crafted.name": "星之釀",

  "entity.astralsorcery.nocturnal_spark": "暗夜火花",
  "entity.astralsorcery.illumination_spark": "螢光火花",
  "entity.astralsorcery.flare": "耀斑",
  "entity.astralsorcery.spectral_tool": "光譜調整器",
  "entity.astralsorcery.item_highlighted": "物品",
  "entity.astralsorcery.item_explosion_resistant": "物品",
  "entity.astralsorcery.item_crystal": "水晶",
  "entity.astralsorcery.item_starmetal": "星輝錠",
  "entity.astralsorcery.observatory_helper": "",
  "entity.astralsorcery.grappling_hook": "",

  "structure.astralsorcery.pattern_altar_attunement.name": "共鳴祭壇",
  "structure.astralsorcery.pattern_altar_constellation.name": "天輝祭壇",
  "structure.astralsorcery.pattern_altar_trait.name": "五彩祭壇",
  "structure.astralsorcery.pattern_celestial_gateway.name": "天體星門",
  "structure.astralsorcery.pattern_ritual_pedestal.name": "效應放大器",
  "structure.astralsorcery.pattern_infuser.name": "星能聚合器",
  "structure.astralsorcery.pattern_enhanced_collector_crystal.name": "強效聚能水晶",
  "structure.astralsorcery.pattern_spectral_relay.name": "光波增幅器",
  "structure.astralsorcery.pattern_attunement_altar.name": "共鳴祭壇",
  "structure.astralsorcery.pattern_singularity.name": "阿尼瑪奇點",
  "structure.astralsorcery.pattern_fountain.name": "萬象泉",

  "astralsorcery.misc.ctrlcopy": "CTRL + 左鍵進行複製",
  "astralsorcery.misc.ctrlcopy.copied": "已複製: %s",
  "astralsorcery.misc.noinformation": "暫無訊息.",
  "astralsorcery.misc.tooltipError": "<嘗試獲取此項目的工具提示時出錯>",
  "astralsorcery.misc.craftInformation": "點擊查看配方",
  "astralsorcery.misc.input.tag": "任何物品有著'%s'標籤",
  "astralsorcery.misc.input.fluid": "任何包含1桶%s的物品",
  "astralsorcery.misc.input.fluid.chain": "%s 或 %s",
  "astralsorcery.misc.recipename": "配方註冊名稱: %s",
  "astralsorcery.misc.knowledge.missing": "空蕩蕩的卷軸",
  "astralsorcery.misc.knowledge.inscribed": "包含了%s的知識",
  "astralsorcery.misc.knowledge.inscribed.creative": "包含了大量的知識",
  "astralsorcery.misc.link.stop": "連結中斷!",
  "astralsorcery.misc.link.start": "已選擇%s!",
  "astralsorcery.misc.link.link": "在%s和%s建立連結!",
  "astralsorcery.misc.link.link.block": "此方塊",
  "astralsorcery.misc.link.unlink": "將%s和%s的連結斷開!",
  "astralsorcery.misc.link.unlink.all": "斷開鎖有連結!",
  "astralsorcery.misc.link.gateway.link": "授權%s使用天體星門!",
  "astralsorcery.misc.link.gateway.unlink": "撤銷%s使用天體星門!",

  "astralsorcery.misc.exchange.size": "尺寸: %s",
  "astralsorcery.misc.exchange.size.2": "5 x 5",
  "astralsorcery.misc.exchange.size.3": "7 x 7",
  "astralsorcery.misc.exchange.size.4": "9 x 9",
  "astralsorcery.misc.exchange.size.5": "11 x 11",
  "astralsorcery.misc.architect.mode": "模式: %s",
  "astralsorcery.misc.architect.mode.line": "從玩家的線",
  "astralsorcery.misc.architect.mode.towards": "朝向玩家的線",
  "astralsorcery.misc.architect.mode.plane": "水平平面",
  "astralsorcery.misc.architect.mode.wall": "垂直平面",
  "astralsorcery.misc.architect.mode.sphere": "球面",
  "astralsorcery.misc.architect.mode.sphere_hollow": "中空球面",
  "astralsorcery.misc.blink.mode": "模式: %s",
  "astralsorcery.misc.blink.mode.teleport": "閃現",
  "astralsorcery.misc.blink.mode.launch": "短跑",

  "effect.astralsorcery.bleed": "流血",
  "effect.astralsorcery.cheat_death": "鳳凰的祝福",
  "effect.astralsorcery.drop_modifier": "內在財富",
  "effect.astralsorcery.time_freeze": "時間凍結",

  "enchantment.astralsorcery.night_vision": "夜視",
  "enchantment.astralsorcery.scorching_heat": "灼熱",
  "enchantment.astralsorcery.night_vision.desc": "賦予佩戴者夜視效果",
  "enchantment.astralsorcery.scorching_heat.desc": "用此附魔挖掘的方塊將獲得熔煉後的掉落物，就像熔爐那樣",

  "astralsorcery.amulet.color.colorless": "原始的",
  "astralsorcery.amulet.enchantment.level.one": "等級",
  "astralsorcery.amulet.enchantment.level.more": "等級",
  "astralsorcery.amulet.enchantment.add_to_specific.name": "加%s %s 至 %s",
  "astralsorcery.amulet.enchantment.add_to_existing_specific.name": "加%s %s 到現有的 %s",
  "astralsorcery.amulet.enchantment.add_to_existing_all.name": "加%s %s 到所有現有的附魔",

  "screen.astralsorcery.hand_telescope": "望遠鏡",
  "screen.astralsorcery.observatory": "瞭望台",
  "screen.astralsorcery.telescope": "天文望遠鏡",
  "screen.astralsorcery.refraction_table": "群星映射台",
  "screen.astralsorcery.tome.progression": "研究",
  "screen.astralsorcery.tome.constellations": "星座",
  "screen.astralsorcery.tome.perks": "星能力",
  "screen.astralsorcery.tome.perks.stats": "星能力統計",
  "screen.astralsorcery.tome": "星輝寶典",

  "key.astralsorcery.disable_perk_abilities": "切換星能力和工具能力",

  "astralsorcery.progress.missing.knowledge": "這似乎記載了什麼,以當前的知識無法理解",
  "astralsorcery.progress.gain.progress.chat": "你的學識增長了",
  "astralsorcery.progress.gain.research.chat": "你對'%s'更了解了",
  "astralsorcery.progress.constellation.discover.chat": "發現%s星座!",
  "astralsorcery.progress.constellation.seen.chat": "你已經記住了%s的內容!",
  "astralsorcery.progress.constellation.seen.track": "你可以在星輝寶典中加入一個標籤來記錄它",
  "astralsorcery.progress.remove.attunement": "的星能力消逝了...",
  "astralsorcery.progress.switch.attunement": "星能力被巧妙地轉換了...",
  "astralsorcery.progress.perk_abilities": "星能力和工具能力現在是%s",
  "astralsorcery.progress.perk_abilities.enable": "啟用",
  "astralsorcery.progress.perk_abilities.disable": "停用",

  "astralsorcery.journal.research.discovery": "發現",
  "astralsorcery.journal.research.basic_craft": "探索",
  "astralsorcery.journal.research.attunement": "共振",
  "astralsorcery.journal.research.constellation": "星宿",
  "astralsorcery.journal.research.radiance": "光輝",
  "astralsorcery.journal.research.brilliance": "輝煌",

  "astralsorcery.journal.node.WELCOME.name": "歡迎",
  "astralsorcery.journal.WELCOME.1.text": "恭喜您選擇在星空學院中進行本科魔法學習。您手中的星輝寶典已由學院的講師特別準備，在您學習期間提供學習指南。每個星輝魔法單元都連結到至此，並根據您的進度自動擴展可用的訊息。<NL>通過這種方式，不需要我們的教授直接指導，您也能夠持續前進，",
  "astralsorcery.journal.WELCOME.2.text": "以最適合您的速度學習需求。 <NL>別誤會這代表這很容易學習。與其他的學習機構相比，本學院以畢業生的素質自豪，並需要證明您熟悉了'星能'操作原理，需要這本星輝寶典以便進一步的訪問檔案館的教育資料。 <NL>祝您有著快樂的學習旅程! <NL>-星光學院的教職員工。",

  "astralsorcery.journal.node.SHRINES.name": "古代神殿",
  "astralsorcery.journal.SHRINES.1.text": "為了有利於實地研究，本學院確定本區域內有著'古代神殿'。它們有著兩種變化:比較大且精緻的古代神殿，其中包含了對星能操作有用的水晶，比較小的古代神殿對於入門的研究組有用。兩者都包含了裝有學習用品的箱子，但確切的內容會基於上次誰起頭使用此位置而改變。大型古代神殿通常位於沒有樹梢的區域，像是沙漠或較冷的山頂。",
  "astralsorcery.journal.SHRINES.2.text": "較大的古代神殿包含了聚能水晶樣本，可用於收集與操作星能，每個聚能水晶被調整至五個星座之一，且有明亮分類，為了對新來的學生最有效益。<NL>這些水晶雖是無可挑剔的，但它們是精製的但非純淨的，不應期望它能提供與練習過精湛工藝的水晶工匠做出的，有著相同的星能水平。由於相同的問題，無法提高這些晶體的性能。",
  "astralsorcery.journal.SHRINES.3.text": "設置了特殊的保護，防止新生們帶走或修改這學習工具，維護本區所有新生都有使用權。 <NL>本學院提醒所有新生，星能不能穿透不透明的固體材料。本學院安裝了屋頂覆蓋並包覆著它，是為了保護研究區域免受惡劣天氣和敵對生物的傷害。若要使用其中的水晶進行學習，必須拆除屋頂以收集星光。",

  "astralsorcery.journal.node.CPAPER.name": "星座圖",
  "astralsorcery.journal.CPAPER.1.text": "在古代神殿的箱子中,可以找到羊皮紙形式的學習用具. These parchments are attuned to the existing Academy archives and will reveal knowledge of an additional constellation to the user when first viewed, as long as their records show sufficient understanding of Starlight Manipulation concepts. Due to this, duplicate records will not be generated for any given initiate. Excess study materials should be left behind for other initiates. These papers can be stored within the 星輝寶典",
  "astralsorcery.journal.CPAPER.3.text": "for future reference by opening the 星輝寶典 while holding Shift. <NL>In the event an initiate would be so irresponsible as to lose their papers, the Academy will not be re-issuing these materials. Instead, the initiate may borrow a copy from another initiate, or recreate them once they have access to a sufficiently advanced crafting altar to properly infuse the constellation knowledge back into parchment. A relatively small cost for such a large lapse of judgment. Thanks to transposition magic, however, papers stored in the initiate's 星輝寶典 will remain accessible even if the 星輝寶典 were to be replaced.",

  "astralsorcery.journal.node.WAND.name": "共鳴星杖",
  "astralsorcery.journal.WAND.1.text": "While the floating crystals in the 古代神殿 will spill some of their internal Starlight onto nearby crafting tables thanks to the Academy's wards, other crystals will not. As this behavior is also fairly wasteful and magically messy, it will not suffice for more delicate crafting. One of the first tools any initiate should obtain is a wand that will allow them to control the release of Starlight energies from Starlight sensitive devices and crafting implements by right-clicking them.",
  "astralsorcery.journal.WAND.3.text": "Due to its sensitivity to gathered Starlight energies, the wand can be used at night to determine areas of conflicting Starlight resonance. The vibrations of this wand, when exposed to open Starlight at night, reveal areas deep underground where contained Starlight energies are contained by a §3crystalline form§r. <NL>These revealed areas appear as almost smokey areas of Starlight displacement above ground.",
  "astralsorcery.journal.WAND.4.text": "One final use of a 共鳴星杖 is that attempting to activate a Starlight device that requires a supporting structure built around it will alert the wielder when the supporting structure is incorrect. Due to the disruptions in flowing Starlight, missing or misplaced portions of the structure will be visually highlighted, allowing for rapid troubleshooting in the construction of these structures.",

  "astralsorcery.journal.node.ORES.name": "礦物",
  "astralsorcery.journal.ORES.1.text": "§8§n水晶石原礦:§r Deep underground near bedrock, the intense pressure can form incredibly rare and fragile crystals. These crystals have a unique internal structure that makes them particularly receptive to Starlight. Despite the relative fragility of these crystals, they are held within hard veins of rock that are prone to destroying the fragile crystals inside unless mined by a tool sufficiently hard itself, such as diamond. Their resonation with Starlight energies becomes visible while holding a 共鳴星杖",
  "astralsorcery.journal.ORES.2.text": "when near these crystal deposits, allowing them to be seen through prevailing blocks before harvest. <NL>§9§n海藍寶石砂岩:§r Polished by the continuous flow of water over fragmented crystal deposits along riverbanks and beaches, these crystals react to the constant low-level exposure to Starlight, resulting in a uniquely transmuted natural resource well suited for Starlight crafting.",

  "astralsorcery.journal.node.ALTAR1.name": "星輝合成台",
  "astralsorcery.journal.ALTAR1.1.text": "The purity of Starlight easily realigns the contents of materials into a more ordered state for their intended purpose. By placing a crafting table near an Academy Shrine's 聚能水晶, its wards will direct Starlight to transmute the crafting table into a crafting instrument more suited to an initiate of the stars. Made of the purest marble, this entry-level altar table can cleanly absorb Starlight energy from the sky or a linked 聚能水晶, and redirect the magical energy into the crafting materials laid in it, instead of relying on a constant magically-messy flood of power.",
  "astralsorcery.journal.ALTAR1.2.text": "In order to capture Starlight on its own, this table needs an unobstructed view of the sky directly above. It also lacks the required matrix that a 聚能水晶 possesses to gather Starlight efficiently, and due to this is unable to compensate for atmospheric diffusion of Starlight energy. Measurements by the Academy indicate sea level is roughly the mid-point in diffusion losses, with bedrock showing nearly full diffusion loss of the energies. Atmospheric diffusion losses disappear at around twice the distance from bedrock as sea level itself.",
  "astralsorcery.journal.ALTAR1.4.text": "If the table is above the atmospheric diffusion height, or other factors make raising the table higher are infeasible, relocating the table to another location in the world would be recommended. Starlight energies are not uniformly distributed from the heavens, and there are areas of the world with far more concentrated Starlight energies available than others. Thankfully, a recurrence of Icarian Famine has not repeated, and survey teams have not recorded instances in modern times of locations with almost no exposure to Starlight energies over large areas.",
  "astralsorcery.journal.ALTAR1.5.text": "Once the items needed as ingredients for the crafting recipe are laid out within the table, right-clicking the table with a 共鳴星杖 will release the reservoir, flooding the ingredients with Starlight power. The resulting crafting item will be ejected from the table automatically once the crafting completes. The current reservoir of stored energy is displayed below the table item interface itself. Due to the volatility of Starlight,",
  "astralsorcery.journal.ALTAR1.6.text": "the storage does not function like a battery that charges over time, but instead reflects the current amount of ambient captured Starlight available for crafting. All but the most simple devices, tools, and material manipulations will require more Starlight than this table can safely redirect and provide with its reservoir. <NL>Once an initiate has used it to build the necessary tools to continue their education, they will also have gained sufficient knowledge in the needed Starlight concepts to improve upon this table, making it far more effective.",

  "astralsorcery.journal.node.MARBLETYPES.name": "大理石",
  "astralsorcery.journal.MARBLETYPES.1.text": "The marble needed by an Astral Sorcerer is an exceptionally pure variant. Magically pristine and highly reflective of magical energies, this marble can be found in sparse veins underground. Other marbles with less magical purity cannot be used for the delicate energy control needed to work with Starlight. Carving channels in prescribed manners will alter how the marble channels nearby Starlight. <NL>While this is the same marble used by the Academy in all of its communal 古代神殿 and other student gathering areas, the",
  "astralsorcery.journal.MARBLETYPES.2.text": "Academy strongly warns all initiates that stealing or defacing the marble used for Academy property will result in punishment to those caught by the faculty, up to and including being expelled from the Academy.",

  "astralsorcery.journal.node.SOOTYMARBLE.name": "燻黑大理石",
  "astralsorcery.journal.SOOTYMARBLE.1.text": "By coating the surface of marble with a magical filtering element, such as coal dust, the marble itself can be changed beyond simply making it \"dirty\". The magical resonance of the marble is fundamentally changed in this way, so that even washing off the dust does not change the new appearance or efficacy of the marble, along with the qualities of the magical energy absorbed and reflected through that surface. This is most useful when attempting to channel larger volumes of Starlight by removing any impurities in their energy that may have been picked up during",
  "astralsorcery.journal.SOOTYMARBLE.2.text": "transmission from source to collector.",



  "astralsorcery.journal.node.HAND_TELESCOPE.name": "望遠鏡",
  "astralsorcery.journal.HAND_TELESCOPE.1.text": "Despite stars having a set location of appearance as they wheel overhead in the sky, certain recurring patterns and shapes will appear to those sensitive to the magical energies emanated by them. These magical constellations have their own schedule they appear within, which is linked to the phases of the moon. A specially crafted glass can be used to make these magical energies far more visible to the viewer. Despite being a rather simple device, the 望遠鏡 will facilitate viewing the strongest of these magical constellations, though the ebb and flow of",
  "astralsorcery.journal.HAND_TELESCOPE.4.text": "interfering energies from other constellations means that only one constellation will be visible to this tool on any given night. <NL>Staring at the night sky without any nearby obstructions is absolutely necessary, and the user must have at least seen one of these constellations traced out before. It is important that once the user believes they have located such a constellation that they hold shift in order to not move the 望遠鏡 at all, and then carefully trace the pattern of the constellation using left-click.",
  "astralsorcery.journal.HAND_TELESCOPE.5.text": "By not holding the 望遠鏡 absolutely still in this way, or without tracing with near-perfect accuracy the constellation, the magical pattern will not be truly §3discovered§r. This discovery is permanently etched into the user's mind and never forgotten, to the point that they will no longer need a device to see it in the night sky at all.",

  "astralsorcery.journal.node.ILLUM_POWDER.name": "輝光粉",
  "astralsorcery.journal.ILLUM_POWDER.1.text": "Glowstone is reactive to Starlight energy, even the small amount resonating within an 海藍寶石. By crushing glowstone together with an 海藍寶石, the resulting pile of dust is highly reactive with itself. Throwing this dust results in a magical light source being suspended in space. <NL>As a floating cloud of dust, it is harder to accidentally snuff than a torch, requiring smothering the light with liquid or a block.",

  "astralsorcery.journal.node.NOC_POWDER.name": "暗夜粉",
  "astralsorcery.journal.NOC_POWDER.1.text": "While a darkened room is the normal method of forcing monsters to spawn for the harvesting of their valuable organs, the placement of these rooms poses logistical challenges besides the requirement of no light. <NL>By leveraging the magical energies in 輝光粉 with certain other reactive ingredients to create an area of anti-light, a throwable powder is made that generates a temporary cloud of darkness that creates monsters from the echoes of the biome within the black cloud for a short while, regardless of the",
  "astralsorcery.journal.NOC_POWDER.3.text": "rarity of those monster spawns. <NL>This cloud does not block the purifying effects of sunlight in its area, and so care should be taken not to drive away or prematurely damage some of the monsters within. <NL>Placing multiple clouds too close to each other, or too frequently in the same space, sees diminishing returns in effectiveness. This is true whether thrown by sorcerer or dispenser.",

  "astralsorcery.journal.node.ILLUMINATOR.name": "洞穴照明器",
  "astralsorcery.journal.ILLUMINATOR.1.text": "When large areas of darkness need illumination, 輝光粉 is insufficient. Not only does it require manual deployment, but it requires the sorcerer to travel into danger directly. Deploying Illumination Sparks using a Starlight-powered device is far better. <NL>By powering the device directly from the nighttime 法斯刻 Field, or a more advanced initiate's 照明星杖, the 洞穴照明器 can provide light coverage over a wide area, in spiraling vertical layers 8 meters apart.",
  "astralsorcery.journal.ILLUMINATOR.3.text": "To prevent unnecessary placement of Sparks, the Illuminator will only place Sparks in areas lower than the Illuminator itself, and only in places that are covered from the sky. If given sufficient time, it can illuminate all the way down to bedrock and will continue to place new Sparks in newly made empty spaces. <NL>Removing the Illuminator will leave the Sparks behind. As removing the sparks is labor-intensive, care should be taken when placing a 洞穴照明器 to prevent lighting up areas that are undesired.",

  "astralsorcery.journal.node.ROCK_CRYSTALS.name": "水晶石的屬性",
  "astralsorcery.journal.ROCK_CRYSTALS.1.text": "Due to the special circumstances that create them, each newly mined 水晶石 is different. These variances in size, purity of the crystal, and even shape of the facets can result in considerable differences in suitability for a purpose. There is no method to determine what these attributes will be for any given crystal before freed from its rocky prison, and while the Academy recognizes that modifications to these crystals are an incredibly important part of their use, it is not nearly as simple as shaping a normal gemstone's appearance.",
  "astralsorcery.journal.ROCK_CRYSTALS.2.text": "Smashing a 水晶石's facets into something as crude as a grindstone would simply destroy them. Other, more refined, methods are needed for §8modifying§r a crystal.",

  "astralsorcery.journal.node.CRYSTAL_GROWTH.name": "水晶石生長",
  "astralsorcery.journal.CRYSTAL_GROWTH.1.text": "Submerging a 水晶石 into a pool of 星能液 until absorbed can be used to repair or grow the crystal into a more robust version of itself, as the internal matrix is realigned and reinforced by the magical energies of concentrated Starlight. When this occurs, the Size of the crystal will increase. There are still limits to what any crystal can have an attribute improved to or its number of attributes, and removal of an attribute is not possible without the intentional use of a specialized tool.",
  "astralsorcery.journal.CRYSTAL_GROWTH.2.text": "Submerging two crystals in 星能液 will cause the crystal with fewer attributes to merge into the crystal with more, with the \"larger\" crystal potentially gaining one or more of the attributes of the absorbed crystal. The more attributes the crystal already has, the less likely this is to occur.",

  "astralsorcery.journal.node.CUTTING_TOOL.name": "星輝碇切割工具",
  "astralsorcery.journal.CUTTING_TOOL.1.text": "Academy texts show that while an iron or steel chisel makes a good tool, it only addresses the physical form, yet Channeling Starlight only addresses the magical form. By combining 星輝碇's hardness with its radiant magical field, both forms can be simultaneously affected. Gold prevents the chisel head's magical field from deforming, reinforcing the tool. <NL>Enchanting the tool will see superior protection against negative results during use.",
  "astralsorcery.journal.CUTTING_TOOL.3.text": "By striking with the tool at a crystal, the crystal and its attributes can be split. The resulting crystals will each inherit a portion of their parent's attributes, but the process is neither even nor perfect. Sometimes attributes may be lost during this process. <NL>Repeatedly submerging crystals and carving pieces from them can be used over time to shape a crystal to a specific purpose, though it can take some considerable §5fortune§r to be efficient.",

  "astralsorcery.journal.node.TOOLS.name": "水晶石工具",
  "astralsorcery.journal.TOOLS.1.text": "While particularly vulnerable to shear forces, 水晶石s can be carefully shaped to channel background Starlight energies to become far more durable than metal tools. By using several crystals to specially craft common tools that channel background Starlight energies, these tools can be crafted to magically leverage the attributes of their component crystals. In this way, a tool may be specially shaped to a more specialized use, and even two tools from the same crafter may have completely different strengths or abilities, based on the crystals used.",
  "astralsorcery.journal.TOOLS.3.text": "More learned initiates may even be able to find methods to provide outside Starlight energy to these tools while in-use to empower them further, or leverage their attributes in other ways.",

  "astralsorcery.journal.node.WELL.name": "聚星缸",
  "astralsorcery.journal.WELL.1.text": "Crystals are receptive to Starlight, naturally generating a dew-like condensate of Starlight when exposed to high concentrations of Starlight. This 星能液 has many uses for a sorcerer, but trying to collect the faint amounts that naturally gather on 海藍寶石 gems or Crystals under normal concentrations is impossible. A special channeling container is needed for gathering and storing Starlight for accelerated, stable 星能液 collection. The more Starlight that is provided to a 聚星缸, the faster it will produce liquid from any given catalyst.",
  "astralsorcery.journal.WELL.3.text": "Inserting a catalyst object into the 聚星缸 using right-click binds it irretrievably to the 聚星缸. This catalyst will be slowly degraded by the Starlight power channeled through it, generating liquid until it is disintegrated entirely. While the lifespan of a catalyst is variable, larger catalysts will produce more liquid and last longer. Starlight-sensitive 海藍寶石 and Crystals generate 星能液, but other catalysts can be used to generate other liquids, such as lava from netherrack.",
  "astralsorcery.journal.WELL.4.text": "Due to the construction requirements to operate, the block directly above the opening of a 聚星缸 must remain empty, even if it is powered by external Starlight energy. Pipes and pumps that actively draw fluids can remove fluid from a 聚星缸 using the bottom face, but cannot return fluid back into a 聚星缸. <NL>The more Starlight receptivity in a catalyst, the more liquid it will produce. 水晶石s provide much more than 海藍寶石s, and enhancing a catalyst with advanced forms will produce more than their base form.",
  "astralsorcery.journal.WELL.5.text": "星能液 has uses outside of Starlight crafting. Besides flowing faster than water and bestowing limited night vision on one bathing in it, it also interacts with other liquids. This supercold fluid will instantly freeze any water that comes into contact with it, and chills flowing lava so quickly that it results in granules of sand instead of stone.<NL>Sometimes, the sand created is imbued with excess Starlight in the process, creating new 海藍寶石砂岩.",

  "astralsorcery.journal.node.INFUSED_WOOD.name": "聚星木",
  "astralsorcery.journal.INFUSED_WOOD.1.text": "As a fibrous material, soaking wood in 星能液 results in the liquid being drawn into the fibers, impregnating and empowering the wood. <NL>This results in a tougher and more resilient material that is particularly well-suited to directing magical energies. Further enrichment can be performed at any Starlight crafting altar if more magical sensitivity is needed.",

  "astralsorcery.journal.node.ALTAR2.name": "共鳴祭壇",
  "astralsorcery.journal.ALTAR2.1.text": "The next test of any initiate is upgrading their 星輝合成台 to allow for outside Starlight manipulation, an important step in progressing into further power using magical Starlight. By making alterations to the table and magically reinforcing the marble involved, the ability to manipulate twice the magical energies of just a 星輝合成台 is possible. <NL>This does require a supporting structure to leverage this extra capacity §bafter§r upgrading the table.",
  "astralsorcery.journal.ALTAR2.4.text": "While having twice the Starlight capacity of a 星輝合成台 is good, another important feature of the Altar is that the reservoir will indicate when it does not have a properly formed supporting structure around it, turning §4red§r when not properly formed. <NL>Multiple items may be crafted at a time if sufficient Starlight exists and sufficient ingredients to complete the crafting are stacked into the table at the same time. The larger an Altar's reservoir, the faster it will craft.",

  "astralsorcery.journal.node.SKY_RESO.name": "法斯刻共振器",
  "astralsorcery.journal.SKY_RESO.1.text": "The magic energy provided by a constellation resonates heavily with its own unique frequency. While very useful when manipulating specific energies, sometimes a sorcerer does not care what constellation the power comes from. Thankfully, much like a sea fed by many rivers, the combined rivers of all constellations also creates a magical sea. This sea is called the 法斯刻 Field, and suffuses down from the heavens the magical energy of the constellations.",
  "astralsorcery.journal.SKY_RESO.2.text": "Regardless of study or power, no sorcerer can see the raw power saturation of the 法斯刻 Field. Unlearned initiates seeking to know the level of the field where they are might move a 星輝合成台 around the world, using its Starlight reservoir to take measurements. <NL>While this is functional, it is not a particularly time-efficient method and exposes the initiate to monsters.",
  "astralsorcery.journal.SKY_RESO.3.text": "A similarly poor method would be a device which displays the raw 法斯刻 Field directly, as it would be like looking for water while swimming in the ocean. <NL>Crafting a device reactive to only the highest concentrations of the field is recommended. Holding this Resonator aloft at nighttime would reveal areas of the highest 法斯刻 concentration, much like a 共鳴星杖 and 水晶石原礦. Rare blue clouds indicate strong areas, and sparks within these clouds indicate the highest concentrations in the field.",

  "astralsorcery.journal.node.SPEC_RELAY.name": "光波增幅器",
  "astralsorcery.journal.SPEC_RELAY.1.text": "While a 法斯刻共振器 is useful to locate high 法斯刻 concentrations, an initiate may not desire (or even be able) to relocate their infrastructure to take advantage of these concentrations. As crafting one's own floating 聚能水晶 is not for novice initiates, manipulating the collection radius of a Starlight altar is the next best thing.",
  "astralsorcery.journal.SPEC_RELAY.4.text": "Utilizing a small structure of marble to channel nearby 法斯刻 energies into an 光波增幅器 would serve as a good 法斯刻 collection point. Inserting a lens into the relay with a right-click would give an outlet for those collected energies. Due to the nature of the Relay, any Starlight crafting apparatus within 16 meters of the Relay itself would have the additional gathered 法斯刻 energies supplied to it. This transfer will be visible to anyone nearby.",



  "astralsorcery.journal.node.TELESCOPE.name": "天文望遠鏡",
  "astralsorcery.journal.TELESCOPE.1.text": "A 望遠鏡 is a good learning tool for an untrained initiate, but has rather severe limits due to its construction. A more stable platform and additional gold tracery will allow for tuning and elimination of conflicting constellation wavelengths, and allow for viewing all constellations in the sky on any given night. The additional stability also allows for tracing of constellations in the Dim classification, as well as the Bright.",
  "astralsorcery.journal.TELESCOPE.3.text": "As with its component 望遠鏡, a telescope requires a clear view of the night sky without the obstruction of buildings or landscape features.<NL>Rotating the telescope's facing to one of the eight sections of the night sky, constellations appear in can be accomplished using the arrows on the left and right side of the viewing window. If a tracing attempt is wrong or made without being exact enough in targeting the constellation's stars, clicking outside of the viewing frame or rotating the telescope to face another section of the sky will clear the previous attempt from the initiate's mind, allowing them to try again.",

  "astralsorcery.journal.node.KNOWLEDGE_SHARE.name": "知識共享",
  "astralsorcery.journal.KNOWLEDGE_SHARE.1.text": "The Academy encourages sharing of knowledge among all initiates, as shared discovery and study benefits the entire student body. Due to the arcane nature of Starlight knowledge, a special scroll embedded with Starlight reactive tracery is needed to expand the reader's understanding, as though they had experienced the discoveries first-hand. Right-click to embed knowledge into or learn from the scroll, or shift + right-click to overwrite embedded knowledge.",

  "astralsorcery.journal.node.LENS.name": "水晶透鏡",
  "astralsorcery.journal.LENS.1.text": "The ability to manipulate and route gathered Starlight is important for all sorcerers. Whether being used to increase the conversion rate of catalysts in a 聚星缸, improving Starlight Altar light availability, or simply transmuting materials, sometimes the Starlight source is just out of range, or more power is needed that could be provided locally. <NL>In these scenarios, lenses are the solution.",
  "astralsorcery.journal.LENS.3.text": "It is recommended by the Academy to have the highest quality standards when selecting crystals to use for crafting lenses, as any imperfections or occlusions in the crystal will translate into the subsequent lens. These will, in turn, see more losses in Starlight transmission for the magical energy they pass along. Using a perfect quality 天體水晶石 for Starlight transmission will negate all losses in magical transmission, but imperfections in each lens along the transmission path will compound losses.",
  "astralsorcery.journal.LENS.4.text": "Bound by the metaphysics around magical Starlight, while a lens can receive Starlight from multiple sources and angles at once, it can only transmit this energy to one location at a time. The housing for a lens can be attached in any orientation that is convenient. <NL>As the lens focuses the magical energy being transmitted to a target point, selecting both distance and angle of the lens using the 連結器 is important for the proper flow of magical energy.",

  "astralsorcery.journal.node.LINKTOOL.name": "連結器",
  "astralsorcery.journal.LINKTOOL.1.text": "Magical energies aren't as easy to handle as the physical world, making magical implements necessary. The Academy's 連結器 is one of the primary tools for any prospective Sorcerer to work with Starlight. Leveraging 海藍寶石s to coordinate a crystal to the magical signature of a block can form a metaphysical link between two positions that facilitate the transmission of Starlight energy. Using a right-click action on a block will store the starting position in the wand, and any subsequent right-clicks will link that initial position to the target block's position.",
  "astralsorcery.journal.LINKTOOL.3.text": "Replacing the block at the target position will make it the target of the link, without needing to create a new link. Blocking a line of Starlight won't prevent the Starlight source from transmitting that power, only that it will be pointlessly dissipated as it cannot be focused on its target position. Multiple links from the same source will have an even split of transmitted power, and so removing existing links is important to not dilute the power transmission when they are no longer needed. To remove a single link, first select the Starlight source, and then shift-right-click the target block position to remove it.",
  "astralsorcery.journal.LINKTOOL.4.text": "To remove all links at once, a shift-right-click on the Starlight source should instead be performed. Removing the 連結器 as the active tool will break the connection to a selected source, allowing a new source to be selected for new links. A selected source will not persist through dimensional changes. <NL>Anything that consumes Starlight can be linked to a Collector to improve the consumer's operation. Links over long distances do not need to remain chunkloaded to continue to transmit Starlight.",

  "astralsorcery.journal.node.STARLIGHT_NETWORK.name": "聚焦星能",
  "astralsorcery.journal.STARLIGHT_NETWORK.1.text": "Focusing collected Starlight into one spot allows the concentrated magical energies to suffuse that position. While this has uses for altering the form of materials, it can also be used with crafting altars or ritual pedestals that need more magical power. Unlike crafting altars, ritual pedestals can only be empowered by light matching the constellation of the active ritual itself.",

  "astralsorcery.journal.node.TRANSMUTATION_ORES.name": "星輝轉化",
  "astralsorcery.journal.TRANSMUTATION_ORES.1.text": "Many materials have a high reactivity to Starlight, and focused exposure will result in a magical transformation. By linking a Starlight-collecting crystal to a block, it will eventually change form. <NL>The most useful of these is creating 星輝碇原礦, but other useful transmutations recorded by the Academy include clay from sand, emerald ore from diamond ore, and cake from pumpkins. The 星輝寶典's icon for this page will rotate through example source blocks.",

  "astralsorcery.journal.node.STARMETAL_ORE.name": "星輝碇原礦",
  "astralsorcery.journal.STARMETAL_ORE.1.text": "星輝碇 is one of the most important metals any sorcerer could use, but does not occur naturally. Suffusing iron ore with enough Starlight will reform the metal's atomic structure, turning it into a proverbial Starlight magnet. This magical ore can be smelted like iron into a starmetal ingot, and radiates a faint magical field of Starlight that will have applications for more advanced initiates.",

  "astralsorcery.journal.node.STARDUST.name": "星塵",
  "astralsorcery.journal.STARDUST.1.text": "While 星輝碇 has many applications for channeling Starlight, the dust from 星輝碇 is even more reactive. Due to the magical energy contained with it, this metal is both simultaneously hard and soft. While it can sustain direct impact with little deformation, attempting to grind or cut it results in the metal behaving more like a putty and smearing out of shape. Disrupting the magical energies in the metal is necessary to create grains of metal dust instead, and the Academy's 星輝碇切割工具 is particularly suited to this.",
  "astralsorcery.journal.STARDUST.2.text": "By striking a starmetal ingot with swift swings of the cutting tool, the sharp impact to both the physical object as well as its magical field will cause the ingot to rapidly destabilize, shattering into a pile of 星塵, instead. <NL>The speed and force required to accomplish this is more than can be leveraged with a crafting table and must be done in-world instead. This is a skill that should be practiced, as it will be used more often during later studies.",

  "astralsorcery.journal.node.RESONATOR_AREA_SIZE.name": "多米刻共振器",
  "astralsorcery.journal.RESONATOR_AREA_SIZE.1.text": "Viewing high concentrations in the 法斯刻 Field is useful, but viewing the applicable reach of applied Starlight is often of more interest to an initiate. Adding specially reactive lenses, powders, and 星塵 to a 法斯刻共振器 will allow it to instead display the disruption in natural Starlight that denotes the area of effect of a ritual pedestal when right-clicked. <NL>Shift-right-clicking will cycle the resonator between 法斯刻 and 多米刻 modes.",

  "astralsorcery.journal.node.CELESTIAL_GATEWAY.name": "天體星門",
  "astralsorcery.journal.CELESTIAL_GATEWAY.1.text": "Few Sorcerers find all the needed resources for their craft nearby. Most have to journey for raw crystals, 法斯刻 concentrations, or even into other dimensions for materials. A reliable and expandable means of safely traveling is an important tool even for an Academy initiate. A network of 天體Gateways makes even cross-dimensional travel easy, and the Gateway itself can be named using an Anvil.",
  "astralsorcery.journal.CELESTIAL_GATEWAY.3.text": "Standing on the Gateway block will allow for seeing between worlds, with each other Gateway showing up as a star among the twinkling void. Gateways will be located in relation to each other, with extra-dimensional gateways showing higher in the sky. Holding shift or right-clicking while facing a Gateway star will transport the user to that Gateway. <NL>Too many Gateways in the same area of the void will result in some not being shown. A Gateway may be named in an Anvil to indicate destination name, or have its destination star colored by crafting it with a dye.",
  "astralsorcery.journal.CELESTIAL_GATEWAY.5.text": "Unfettered access to sensitive areas is risky. A Gateway may be secured as a private Gateway by right-clicking it with an aquamarine, and the lock removed by repeating the process with an open hand. Access can be expanded by using a linking tool to link a person to a locked gateway.<NL>Standing on a private Gateway will cause the name and personal constellation of each allowed person to display on the white marble outer ring. Right-clicking the block displaying the constellation will revoke access to the private Gateway.",

  "astralsorcery.journal.node.ALTAR3.name": "天輝祭壇",
  "astralsorcery.journal.ALTAR3.1.text": "Due to the unique light channeling properties of 星塵, improvements can be made to the crafting altar. Reinforcing the existing altar with additional 海藍寶石, marble, and another crystal with 星輝碇 and 星塵 will greatly improve the capacity of the 天輝祭壇 over its predecessor. <NL>Completing this upgrade demonstrates another level of educational advancement for an initiate, and additional study materials will be made available.",
  "astralsorcery.journal.ALTAR3.4.text": "Because of the additional channeling abilities to the altar that this change brings, a larger support structure with more sooty marble is needed to ensure a sufficient supply of Starlight is available in a timely manner.",

  "astralsorcery.journal.node.ATT_PLAYER.name": "共鳴星能力",
  "astralsorcery.journal.ATT_PLAYER.1.text": "Using full-spectrum Starlight is useful for general crafting, but filtering and limiting the Starlight to one specific constellation is far more effective for certain focused uses. A good sorcerer understands well the value of focusing a magical effect from a specific constellation, and leveraging this into specialized crafting is a key component to unlocking further advancement in studies at the Academy.",
  "astralsorcery.journal.ATT_PLAYER.2.text": "Any structure capable of filtering extraneous Starlight frequencies would need to cover a large area. The absorptive properties of sooty marble prove exceptionally useful at trapping the undesired Starlight and keeping it away from the desired magical pattern. Using Astral Relays directly on the sooty marble allows the chosen resonance to be pulled back out of the marble without risking losses through conventional redirection with marble. The altar block itself may serve as a relay for this purpose.",
  "astralsorcery.journal.ATT_PLAYER.4.text": "Using an array of relays to mimic the appearance of a constellation serves to latch its magical pattern, allowing the central focus to attune an item on top of it to the constellation's magical frequency. The concentrated energies stored in the large sooty base during nighttime will react when presented with a held constellation paper, showing the correct placement of the relays for the constellation on the paper.",
  "astralsorcery.journal.ATT_PLAYER.6.text": "When the relays are aligned to filter the gathered Starlight, a visible reaction will occur, drawing the constellation in blue Starlight beams above the marble surface. Whatever (or whomever) is placed into the center of the attuning altar will be bombarded by the intense, filtered Starlight energy. This will forcibly attune the existent internal energies of the target to the chosen constellation. <NL>This attunement is necessary for an initiate to be able to comprehend constellations beyond the 5 Bright classification constellations.",

  "astralsorcery.journal.node.ATT_PERKS.name": "特化星能力",
  "astralsorcery.journal.ATT_PERKS.1.text": "Like crystals, attuning the Starlight energies residing within the body allows application of those energies to directly enhance oneself. While any magical ability can be accessed by properly focusing the Starlight to that purpose, the initial attunement performed will change how much effort it takes to get to that goal, as well as the actions that must be taken to \"exercise\" the attuned energies. <NL>A person may only be attuned to Bright constellations.",
  "astralsorcery.journal.ATT_PERKS.2.text": "Controlling how these inner magical energies are channeled requires meditation beyond the ability of most sorcerers, regardless of skill. To assist in this, the Academy has included within the 星輝寶典 a page of meditation tools that aid the meditant in visualizing the shape and allocation of these spare energy points. <NL>These tools can be located under the \"Perks\" tab of the 星輝寶典.",
  "astralsorcery.journal.ATT_PERKS.3.text": "Focusing these points of magical energy in different ways will result in different effects. Unfortunately, due to the resulting patterns being etched into a person's magical form, there is no easy method to recover allocated points individually, though there are methods to temporarily seal a specific point's magic (covered later in this 星輝寶典). To clear allocated points, the energies must be disrupted by directly impacting their attuned root. Clearing an attunement from the body will necessitate re-attuning it to start meditative assignment over again.",
  "astralsorcery.journal.ATT_PERKS.4.text": "There are three magnitudes of bonuses provided by internal Starlight.<NL>Added/Subtracted - Adds a flat value to the base amount.<NL>Increased/Decreased - All of these are summed together, and then applied after all Added/Subtracted values are applied.<NL>More/Less - These are not summed and then applied, but applied individually following the Increase/Decrease changes.",

  "astralsorcery.journal.node.SHIFT_STAR.name": "更替之星",
  "astralsorcery.journal.SHIFT_STAR.1.text": "As attunement perks cannot be easily removed, the earliest method is to disrupt the personal attunement by using a 更替之星. The resonance of this artificial crystal is disruptive to the magical attunement of the user, and holding right-click long enough while the star is held will eventually cause it to wipe out any personal attunement, disintegrating the star in the process. <NL>This will wipe away any progress made with attunement perks, and necessitate re-attuning to start over.",

  "astralsorcery.journal.node.ATT_PERKS_SEAL.name": "封閉星能力",
  "astralsorcery.journal.ATT_PERKS_SEAL.1.text": "Occasionally an 共鳴perk may not be desired, but must be used to traverse to deeper perks, or may be only intermittently desired. Rather than use a 更替之星 to disrupt and reset all Attunement progress, a magical sigil can be applied to the body to suppress a single perk's effect without impacting other perks. Seals held in the inventory can be dragged and dropped onto a perk point in the tree, applying it to the body and matching it to the perk's 共鳴energies. Double-clicking the sealed perk will break the seal. There is no limit to the number of seals that may be active.",

  "astralsorcery.journal.node.ATT_PERK_GEMS.name": "寶石",
  "astralsorcery.journal.ATT_PERK_GEMS.1.text": "水晶石s and their derivatives are exceptional at gathering Starlight but are like a sieve when it comes to storing it. By doping the exterior of a crystal to serve as an internally-facing mirror, the residual effects of Starlight can be captured, though the light drains away. <NL>Throwing a 水晶石 into a bucket of 星能液 with 輝光粉 will result in a reaction with the crystal, eventually evaporating both the 星能液 and the 輝光粉 and leaving behind a small crystal cluster.",
  "astralsorcery.journal.ATT_PERK_GEMS.2.text": "Once it has slowly grown through several stages into a large, shimmering cluster, it can be harvested. The resulting 寶石 is reactive to local Starlight energies, strengthening the flow of magical energy in their wielder's body, which can be felt while holding the 寶石. The time of day the cluster grows can impact the type of crystal that forms - Day, Night, or during Dawn and Dusk. The time of growth will change the type of gem created: 伊利姆寶石s, grown during the day, tend to have weaker, yet more numerous enhancements. 奧瑞姆and 芬格姆gems, grown at darker hours, tend to have more potency in their aspects.",
  "astralsorcery.journal.ATT_PERK_GEMS.3.text": "Once fully grown, these clusters may sometimes revert back to their immature form. <NL>A gem's enhancements vary from two to four in number. To benefit from one or more of these gems, a 寶石 Socket perk will need to be allocated. These special Attunement locations are receptive to the flux created by these gems. <NL>Once allocated, selecting the Socket will allow a Sorcerer to select a 寶石 in their inventory, gaining its enhancements as it is temporarily absorbed into their form. Removing the 寶石 from its Socket will return it to the inventory, so that it may be replaced with another, or the socket left empty.",

  "astralsorcery.journal.node.ATT_CRYSTAL.name": "水晶共鳴",
  "astralsorcery.journal.ATT_CRYSTAL.1.text": "An important step towards crafting Starlight collecting crystals, attuning a crystal to a constellation's magical frequency allows it to discard the magical light of any other constellation, much like a goose sheds water from its back. <NL>While the resultant attuned rock can be used to greatly improve the distillation of 星能液 from a lightwell when used as a catalyst, an attuned crystal is merely an intermediary material until further refined by a more skilled initiate.",
  "astralsorcery.journal.ATT_CRYSTAL.2.text": "共鳴crystals may still be worked with a 星輝碇切割工具 as any other crystal, but the likelihood that the attunement will survive the process for all shards created is low. <NL>Once attuned, a crystal cannot have its attunement changed to another without catastrophic results to the integrity of the crystal, and the standard attunement altar has safeguards created by the Academy in its design to prevent such process.",

  "astralsorcery.journal.node.RIT_PEDESTAL.name": "效應放大器",
  "astralsorcery.journal.RIT_PEDESTAL.1.text": "The magical power of Starlight can have a direct effect on the local area if sufficiently gathered and filtered. By placing an 共鳴crystal into a 效應放大器, Starlight from only one constellation will be passed into the device, creating a magical effect as it resonates with the crystal inside the pedestal's heart. As a constellation's Starlight is greatly diminished while not overhead in the sky, feeding the pedestal with additional gathered Starlight of the same constellation may see a great increase in potency.",

  "astralsorcery.journal.node.PED_ACCEL.name": "儀式加速",
  "astralsorcery.journal.PED_ACCEL.1.text": "Ritual Pedestals are not as effective as 聚能水晶s at gathering Starlight. Linking a 聚能水晶 to the Pedestal will see increased speed of the ritual, as long as the light is from the same constellation as the 共鳴Crystal in the pedestal. Due to how rituals operate, this additional Starlight does not directly feed the magical ritual itself, but does provide additional magical energy to be manipulated by the pedestal.",
  "astralsorcery.journal.PED_ACCEL.2.text": "As the energy being provided to a ritual increases, balancing the ritual will need to be performed to increase its speed. Beams of Starlight will be sent from the pedestal where there is an imbalance, and a 水晶透鏡 should be placed at the end of each beam and linked to the pedestal to balance the flow of energy. This will require a maximum of five reflections, at which time the ritual will be fully balanced, no matter how much more Starlight is channeled into it.",
  "astralsorcery.journal.PED_ACCEL.3.text": "A ritual's operating speed is dependent on how much Starlight energy is being provided. The placement of these balancing lenses will not need to change if the 共鳴Crystal in the pedestal is removed or exchanged unless the constellation of the Attunement also changes. <NL>If an Anchor is present, the pedestal will automatically mirror the energy balance to the anchor from any 水晶透鏡es present, creating a dazzling show of Starlight energy.",
  "astralsorcery.journal.PED_ACCEL.4.text": "While the Academy has been unable to measure a maximum speed of operation for any ritual, the 共鳴Crystal in the pedestal definitely has limits. Continuing to accelerate the operation speed of a ritual once it is fully balanced may cause stress Fracturing of the 共鳴Crystal, risking parts of the crystal breaking off and reducing attributes.",

  "astralsorcery.journal.node.QUICK_CHARGE.name": "星能充能",
  "astralsorcery.journal.QUICK_CHARGE.1.text": "More learned initiates understand that Starlight energies suffuse more than blocks and pool more places than the 法斯刻 Field. All things contain some Starlight energy of at least one constellation, including the bodies of prospective Sorcerers. <NL>Charge can be used to fuel implements designed to channel this power source. While the Charge cost will vary based on the magic used, the channeler will be able to determine how much of their stored Charge will be expended on use of any held magical utensil.",
  "astralsorcery.journal.QUICK_CHARGE.2.text": "While this reservoir starts small, it will refill on its own from the nearby environment, allowing for continuous use of charge-requiring tools when the use is spread out, especially if under the night sky. <NL>Some effects may require more charge than can be held at once, and §1Attuning§r oneself to a constellation may be needed to expand this internal reservoir, or even impact how quickly the charge can recover.",

  "astralsorcery.journal.node.TOOL_CHANNEL.name": "充能頻道",
  "astralsorcery.journal.TOOL_CHANNEL.1.text": "While the Academy has seen no indication that directly channeling Starlight Charge to affect the world by any Sorcerer is possible, utilizing specially crafted implements makes it easy for using this energy to create magical effects by almost any initiate. Common uses include creating Illumination Sparks from an 照明星杖, empowering 水晶石工具, launching through the air, or even by graduated sorcerers bolstering their magic Mantles. Many initiates find the most helpful use of this Charge is when constructing the many structures needed to progress",
  "astralsorcery.journal.TOOL_CHANNEL.2.text": "their studies with two building-specialized wands: the 轉位星杖, and the 秩序星杖.",

  "astralsorcery.journal.node.TRAVERSAL_WAND.name": "橫行星杖",
  "astralsorcery.journal.TRAVERSAL_WAND.1.text": "The 橫行星杖 operates in two modes. Dash Mode allows the wand to be charged, launching the wielder when released with a forcefulness equal to the total Charge energy in the direction faced. In Blink Mode, the wand instead will teleport the wielder to the target location when activated. Care should be taken in Blink Mode to note which face of a block is targeted, lest the wielder find themselves falling down a cliff face instead of landing atop it.",

  "astralsorcery.journal.node.GRAPPLE_WAND.name": "衝擊星杖",
  "astralsorcery.journal.GRAPPLE_WAND.1.text": "The 衝擊星杖 serves as a magical grappling hook, sending a beam of Charge towards the targeted location. Once it connects with its target, it will arrest any existing movement of the wielder and instead pull them to the targeted location. This wand has an internal cooldown before it can activate again, in addition to the Charge cost.",

  "astralsorcery.journal.node.TOOL_WANDS.name": "秩序星杖",
  "astralsorcery.journal.TOOL_WANDS.1.text": "For both the Conversion and Formation wands, shift-right-clicking a block will configure the block they will use from the wielder's inventory to enact their magical effect.<NL>Conversion wands can be shift-right-clicked in the air to alter the size of the area they will replace when used. Multiple blocks may be set at once, which will generate a random pattern of all selected blocks when activating this wand if sufficient blocks are in the user's inventory.",
  "astralsorcery.journal.TOOL_WANDS.3.text": "Formation wands have multiple placement modes they operate in, with the default mode being a line placed orthogonally from the targeted block face back to the wielder's position. Additional modes include building a direct line from the wielder to the targeted face, placing a horizontal plane of blocks at the targeted location, placing a vertical plane of blocks at the targeted location, or spheres that are either solid or hollow. These sizes are fixed. <NL>Botanical mages can leverage mana through their own rods to supply blocks for these wands directly.",



  "astralsorcery.journal.node.LENSES_EFFECTS.name": "彩色透鏡",
  "astralsorcery.journal.LENSES_EFFECTS.1.text": "Filtration of Starlight magic is accomplished by Constellation Attunement, but filtering the energy isn't the only way to change its magical effects. By using aligned ingredients to dope a glass lens, Starlight passed through the lens will be twisted to only a specific aspect of the light, regardless of which constellation to which it belongs. <NL>Because this light is not limited to a specific constellation, explicit focus of the energy does not matter, and simply being bathed in the light will see a magical effect applied.",
  "astralsorcery.journal.LENSES_EFFECTS.2.text": "Affixing one of these colored lenses to a 水晶透鏡 array will filter any light sent through it. Unfortunately, shifting the spectrum of the magical energy with one of these lenses will not persist through another lens or prism, which will disperse the magical frequency shift and bring it back to normal. If the effect is desired through multiple crystal lenses in a chain, a colored lens would need to be applied to each 水晶透鏡 in the chain.",

  "astralsorcery.journal.node.IGNITION_LENS.name": "點燃透鏡",
  "astralsorcery.journal.IGNITION_LENS.1.text": "The beam from an 點燃透鏡 heats things up until they catch on fire. Creatures will burn under the flames, and items dropped or blocks placed in its path are smelted down as though subjected to a furnace. <NL>The rate of ignition is based on how much Starlight is passing through the lens.",

  "astralsorcery.journal.node.BREAK_LENS.name": "破壞透鏡",
  "astralsorcery.journal.BREAK_LENS.1.text": "The beam of a 破壞透鏡 breaks any blocks placed into its path, except those that cannot be broken such as Illuminated blocks and bedrock. <NL>How quickly a placed block is broken is based on how much Starlight is passing through the lens.",

  "astralsorcery.journal.node.DAMAGE_LENS.name": "傷害透鏡",
  "astralsorcery.journal.DAMAGE_LENS.1.text": "Creatures in the beam from a 傷害透鏡 will periodically take damage as though struck by a sword. <NL>The rate at which damage is dealt depends on how much Starlight is passing through the lens.",

  "astralsorcery.journal.node.PUSH_LENS.name": "抗拒透鏡",
  "astralsorcery.journal.PUSH_LENS.1.text": "The beam of a 抗拒透鏡 applies a constant force away from the lens to both items and creatures in its path. An icy path can accelerate how quickly an affected object or creature is moved. <NL>The frequency of the pushing effect is based on how much Starlight is passing through the lens.",

  "astralsorcery.journal.node.REGENERATION_LENS.name": "再生透鏡",
  "astralsorcery.journal.REGENERATION_LENS.1.text": "The beam of a 再生透鏡 encourages rapid regeneration of injuries. <NL>How frequently this healing is applied depends on how much Starlight is passing through the lens.",

  "astralsorcery.journal.node.GROWTH_LENS.name": "生長透鏡",
  "astralsorcery.journal.GROWTH_LENS.1.text": "The beam from a Growth lens subjects any plants in its path to rapid growth, as though by fertilizer or by any other method that would cause the plant to grow. <NL>How often a plant is forced to grow is based on how much Starlight is passing through the lens.",

  "astralsorcery.journal.node.SPECTRAL_LENS.name": "匯聚透鏡",
  "astralsorcery.journal.SPECTRAL_LENS.1.text": "There are times when operating under an open sky isn't possible, and the safety of the underground or behind a closed door is needed. Starlight transmission through glass can solve some of these problems, but sometimes this is not possible. The modulation of a 匯聚透鏡 allows collected Starlight to transmit through solid blocks, though this subjects the stream of Starlight to small losses.",

  "astralsorcery.journal.node.INFUSER.name": "星能聚合器",
  "astralsorcery.journal.INFUSER.1.text": "Increasing the reactivity of materials to Starlight energy is necessary in many cases. The Academy recognizes only a few materials that are receptive to simply submerging them into 星能液. Arcane fluid Infusion is needed to transmute many objects into what the Academy considers their more \"natural\" states than applying magical spectra directly allows. This is more temperamental than Attunement or 星輝轉化. 星能液 is a sufficiently meterable source of magical energy, but needs a more balanced introduction to the target material.",
  "astralsorcery.journal.INFUSER.3.text": "By drawing from the structure's 星能液 reservoir, no sky access is required for a 星能聚合器 to work. The more volatile storage method of the liquid magic does mean partial losses of the liquid may be common when agitation is introduced during the Infusion process. The lost liquid must be replaced before the Infuser will allow subsequent activation for safety. Using a 共鳴星杖 will activate the 星能聚合器 much like other Starlight crafting devices. <NL>The Academy has blocked these devices infusing creatures on ethical grounds.",

  "astralsorcery.journal.node.ENCHANTMENT_AMULET.name": "璀璨棱鏡",
  "astralsorcery.journal.ENCHANTMENT_AMULET.1.text": "更替之星s normally resonate in chaotic and strange patterns, which allow them to disrupt personal attunements. This chaos can be halted when exposed to specially filtered Starlight. With the emanating power no longer constantly in flux, a more focused benefit can be achieved.<NL>Directing these energies into an Eye of Ender causes them to softly radiate and diffuse outwards a short distance, interacting with existing magical fields worn or held.",
  "astralsorcery.journal.ENCHANTMENT_AMULET.3.text": "While worn, a 璀璨棱鏡 adds or empowers magical effects applied to the rest of the wearer's equipment. Controlling this empowerment is not possible, and the effect is based entirely on the magical frequency the 更替之星 was locked into.<NL>Re-exposing a 璀璨棱鏡 to filtered Starlight momentarily releases the frequency lock, with the uncontrollable chaos of the 更替之星 determining the magical results when it becomes set again.",

  "astralsorcery.journal.node.RITUAL_LINK.name": "儀式連結器",
  "astralsorcery.journal.RITUAL_LINK.1.text": "The supporting structure for a 效應放大器 takes up considerable space, an unfortunate necessity to channel Starlight into a magical ritual. The Academy has devised a way to relocate the epicenter of the magical emanations from a ritual pedestal using a combination of linked anchors. By placing one anchor five meters above the pedestal, a 連結器 can connect it to another anchor placed anywhere else in the same dimension. This will cause the linked Anchor to function as the source of the effects, centering the magical ritual on itself.",

  "astralsorcery.journal.node.ILLUMINATION_WAND.name": "照明星杖",
  "astralsorcery.journal.ILLUMINATION_WAND.1.text": "Rather than drawing the passive Starlight power from glowstone and aquamarine or from the latent 法斯刻 field, personal Attunement Charge can be used to create illuminating sparks when properly channeled. By combining dye with an 照明星杖, the color of the spark can be changed. Channeling Charge into a 洞穴照明器 through this wand will also provide the Illuminator with enough energy to run without nighttime 法斯刻 strength or access to the sky for 10 seconds. When a 洞穴照明器 is powered in this fashion, it will start placing sparks matching the wand's color.",
  "astralsorcery.journal.ILLUMINATION_WAND.3.text": "Performing a shift-right-click on a block will channel enough Charge energy into the block to bridge the gap between the magically ethereal, and the real world. This will cause the block to take on the appearance of an ethereal ghost, tinted the color of the wand. By bridging existence in this fashion, the block is placed into ethereal stasis and will be totally unbreakable just like bedrock, until shift-right-clicked again to bring it back fully into the real world, making it breakable again. Any 照明星杖 can remove a block from this state, not only the one used to Illuminate it.",

  "astralsorcery.journal.node.CHARGED_TOOLS.name": "聚星水晶石工具",
  "astralsorcery.journal.CHARGED_TOOLS.1.text": "As crystalline tools already rely heavily on channeling passive Starlight for their function, they behave differently when Infused. Rather than transmuting their physical form, they instead have the natural magical pathways inside the crystals reinforced, allowing for far more direct and obvious magical effects when supplied with magic. Feeding these tools with the natural Starlight Charge of the wielder will manifest this magic, but this will apply stresses to the crystals that require a \"cooldown\" period before the process is repeated. Over time, the tool will",
  "astralsorcery.journal.CHARGED_TOOLS.2.text": "dissipate its own Infusion and require a redo. <NL>The magic manifested by this Charge energy relates directly to how the crystals were shaped in crafting the tool. Axes can harvest many connected parts of the struck tree at once, pickaxes can ethereally detect nearby ores, shovels can dig a broader hole at once, and swords will unleash a blast of magical energy on impact that causes other nearby foes to also be injured.",

  "astralsorcery.journal.node.TREEBEACON.name": "烽火樹",
  "astralsorcery.journal.TREEBEACON.1.text": "Living matter is more receptive to Starlight than non-living matter, and new growth even more so. This is shown most-readily with plants, and the most reactive are those that grow the largest: trees. By tapping into that natural reactivity with a specially crafted beacon, a snapshot of the essence of the tree can be captured at the moment it grows from a sapling, expending the growth into an ethereal construct exemplifying the essence of that sapling. The sapling itself will be consumed to fuel the creation of this echo. By passing captured Starlight through this",
  "astralsorcery.journal.TREEBEACON.3.text": "echo, it may be extruded into real products of that tree. <NL>In this way, far more resources can be created magically from this echo than if the real tree were to be harvested. Focusing Starlight into this beacon will accelerate how quickly the resources are generated, with light from生息座 providing the most benefit. Foliage is least likely to be generated by the beacon, as it is furthest from the essence of each tree. <NL>While each beacon can support multiple echoes, each echo has a limited lifespan and will eventually break down, requiring the planting of a new sapling.",

  "astralsorcery.journal.node.PRISM.name": "水晶棱鏡",
  "astralsorcery.journal.PRISM.1.text": "While crystal lenses form the backbone of any distributed Starlight network, they can only transmit to a single location at once, which limits possibilities. The 水晶棱鏡 solves this, though at a much greater material cost. The same principles behind crafting 水晶透鏡es apply here, with the crystal used as the heart of the prism dictating the transmissive qualities of the prism. A crystal prism will evenly distribute and Starlight it received from a collector to all its target links.",

  "astralsorcery.journal.node.DRAWING_TABLE.name": "群星映射台",
  "astralsorcery.journal.DRAWING_TABLE.1.text": "Enchanting through bulk communal knowledge is a somewhat inexact process. By leveraging the properties of constellations and the focus of Starlight, more powerful enchantment combinations than may be normally available becomes a possibility. <NL>Specially etched panes of glass are needed for this process. <NL>Up to three constellations at a time may be leveraged with the 群星映射台, assuming all are in the sky at once.",
  "astralsorcery.journal.DRAWING_TABLE.3.text": "Placement of the constellations for tracing is important, as interference from lines crossing other constellations will reduce the overall strength. Overlapping individual stars is recommended when possible for maximum effect. <NL>Starlight-reactive 羊皮紙 is needed to perform the tracing that will guide the etching of the subsequently prepared glass. <NL>The Academy warns that repeating the use of a single constellation on the same 羊皮紙 or etching will not improve the end result, and due to interference among all tracings, may actually hamper the outcome.",
  "astralsorcery.journal.DRAWING_TABLE.4.text": "Once an Etched 聚星玻璃 is created, it may be used to directly enchant an unenchanted piece of equipment or book, if all the constellations on the glass are in the sky. <NL>Using this method, normally antithetical enchantments may be placed alongside each other on the enchanted item, and the resulting enchanted item may be more powerful than could be normally created. Books enchanted this way may not be able to have their full power placed onto an item.",
  "astralsorcery.journal.DRAWING_TABLE.6.text": "The essence of the enchantment may also be instilled into a bottle of water, or a mundane, thick, or awkward potion to create Stardew - a magical beverage that provides various effects to the imbiber for a short period of time, depending on the constellations leveraged.",

  "astralsorcery.journal.node.ALTAR4.name": "五彩祭壇",
  "astralsorcery.journal.ALTAR4.1.text": "The final test for any initiate to graduate the Academy as an Astral Sorcerer is to complete construction of an 五彩祭壇 - the most advanced method of Starlight Crafting presently known. Brute force will only succeed for so long with magic before a more deft hand is needed to prevent disaster. <NL>By filtering received Starlight through an 共鳴Crystal socketed into the altar, the influence of only a single constellation can be applied to the crafted item without risking a rapid and catastrophic unplanned disassembly.",
  "astralsorcery.journal.ALTAR4.4.text": "To make the most use of this approach to filtered magic, Astral Relays can be placed on any sooty marble of the altar structure. They will allow for specific items to be placed during the crafting process when requested by the altar, so their essence may be infused into the crafted item. <NL>These items will show in the crafting recipe as orbiting the outside of the crafting grid, and any required 水晶共鳴 will be shown in the background of the recipe.",

  "astralsorcery.journal.node.COLL_CRYSTAL.name": "聚能水晶",
  "astralsorcery.journal.COLL_CRYSTAL.1.text": "共鳴水晶石s serve as good filters for Starlight, but only have the same receptivity as any other block. By using a 天輝祭壇 to apply a coating of several substances that are more receptive to Starlight, this receptivity can be greatly enhanced. The 聚能水晶 crafted in this fashion will gather all Starlight within 8 meters of itself, discarding the light that does not match its Attunement.",
  "astralsorcery.journal.COLL_CRYSTAL.3.text": "These Crystals operate like the ones in the Academy-provided study temples and can be used in the same fashion, but with the ability to move them for convenience. Due to the reach of each crystal, placing them too close together will see diminishing returns in total gathered Starlight. <NL>For best performance, care should be taken in selecting the qualities of the crystal used to craft these Collectors, as once crafted, they cannot be changed.",
  "astralsorcery.journal.COLL_CRYSTAL.4.text": "Furthermore, the Academy warns that using unorthodox methods of moving 聚能水晶s other than breaking and placing, such as cardboard boxes, may cripple their magical field, leading to unprecedented effects on the efflux of Starlight.",

  "astralsorcery.journal.node.CEL_CRYSTAL_GROW.name": "水晶簇",
  "astralsorcery.journal.CEL_CRYSTAL_GROW.1.text": "Studies into the internal structure of 水晶石s show that there are limits to how large they can grow along with limits to their qualities. Purified iron is weaker than when adding some carbon to make steel, and in the same fashion 水晶石s need an introduced impurity to alter their internal structure for superior performance. <NL>星塵 is this impurity, but a magical crucible is needed to bring this change to bloom, though it is a two-step process.",
  "astralsorcery.journal.CEL_CRYSTAL_GROW.2.text": "Submerging a 水晶石 into a bucket of 星能液 with a handful of 星塵 will see a rapid boil occur in the mixture. Once the 星能液 and excess 星塵 have boiled off, what remains will be a small crystal cluster. Exposure to Starlight from the sky above or from a linked 聚能水晶 will result in this crystal cluster changing its internal structure, growing over time in several stages. <NL>Harvesting the cluster will see more attributes on the resulting crystal than it started with.",
  "astralsorcery.journal.CEL_CRYSTAL_GROW.3.text": "A crystal cluster that is ready for harvest will shimmer with light.<NL> It is recommended to have the cluster grow on a block of 星輝碇原礦 for several reasons. The magical radiation of the ore will generate sympathetic magical eddies in the crystal that accelerate the growth process, though each stage of growth will disrupt the ore's magical field sufficiently to revert it to iron ore. The Academy recommends having a nearby Collector to transmute the ore again each time this occurs.",

  "astralsorcery.journal.node.CEL_CRYSTALS.name": "天體水晶石",
  "astralsorcery.journal.CEL_CRYSTALS.1.text": "Celestial-class crystals are superior in every single quality to a normal 水晶石, and can be easily identified by their brilliant blue color resulting from the inclusion of 星塵. <NL>In any instance where a 水晶石 could be used, a 天體水晶石 could be substituted, including the creation of水晶簇s with slightly different attributes. Some advanced applications require the superior structure of a 天體水晶石.",

  "astralsorcery.journal.node.ENHANCED_COLLECTOR.name": "強效聚能水晶",
  "astralsorcery.journal.ENHANCED_COLLECTOR.1.text": "天體水晶石s create superior 天體聚能水晶s, but the wax and wane of a constellation over the world do not change. 天體聚能水晶s can be supported by a structure that evens out the ebb and flow of this energy. While the Collector won't provide as much Starlight when its constellation is in the sky, it will provide much more when its constellation is not in the sky, allowing Rituals and Transmutations to run when they otherwise would be greatly slowed.",



  "astralsorcery.journal.node.ATT_TRAIT.name": "強化水晶共鳴",
  "astralsorcery.journal.ATT_TRAIT.1.text": "The light from Faint-class constellations is insufficient to fuel rituals or fully Attune a crystal, but it is sufficient for enchanting items or creating Stardew. The spectrum of their energies is also sufficient to alter a crystal's Attunement subtly. Setting relays in the proper form for these constellations on an 共鳴祭壇 allows an already 共鳴crystal to have a single Trait applied that modulates its channeling of Starlight.",
  "astralsorcery.journal.ATT_TRAIT.2.text": "Once a trait has been applied to an 共鳴crystal, it cannot be changed. <NL>Collectors crafted from a crystal with a Trait will retain the trait, but it will have no effect on the Starlight filtered. <NL>Additional information about the effect of each of these Traits has been added to the Faint constellations in the 星座 tab.",

  "astralsorcery.journal.node.OBSERVATORY.name": "瞭望台",
  "astralsorcery.journal.OBSERVATORY.1.text": "To increase visual reach into the stars, more filtered lenses and reactive powders will be needed than the 天文望遠鏡 required. The more sensitive viewing an 瞭望台 offers allows a Sorcerer to delve deep into the skyfield, following the slightest hint of magical energies back to its source constellation. <NL>In the deep depths of the Astral, more constellations faintly shine their magical power forth, barely distinguishable against the background noise of existence.",
  "astralsorcery.journal.OBSERVATORY.3.text": "As the 瞭望台 is very precise, moving the mouse is necessary to aim around the night sky. When a prospective constellation is located, holding shift will lock the view, allowing the constellation to be traced. Press Right-click/Esc to leave the 瞭望台 view, and dismount the observatory's seat by pressing shift.",

  "astralsorcery.journal.node.ENH_SHIFTING_STAR.name": "輻射之星",
  "astralsorcery.journal.ENH_SHIFTING_STAR.1.text": "更替之星s are well suited to brute-force disruption of a personal Attunement, but more refined methods exist. <NL>Filtering the light used for crafting and adding aspects from items allows an advanced Star to be crafted that modulates Attunement energies instead of disrupting them to failure. The Attunement root will shift to match the 輻射之星, and all perk points will be deallocated, but any growth progress will not be reverted. This allows the sorcerer to re-allocate those points without losing any.",

  "astralsorcery.journal.node.CRAFTING_FOCUS_HINT.name": "聚焦合成",
  "astralsorcery.journal.CRAFTING_FOCUS_HINT.1.text": "With the successful crafting of the 五彩祭壇, the Academy would like to welcome you as a fully-fledged Astral Sorcerer. New horizons now await your own independent studies. The safety measures previously enforced through your bond with the Academy's library through this 星輝寶典 have now been removed. Additionally, previously forbidden knowledge is also now available within your 星輝寶典 as a result of post-graduate contributions to the Academy's knowledge stores.",
  "astralsorcery.journal.CRAFTING_FOCUS_HINT.2.text": "Attempting to craft with the 五彩祭壇 will no longer cancel and fail if the available amount of Starlight drops below the minimum needed to complete the craft, such as falling Starlight levels during dawn. The crafting will be held in stasis at the Altar until the amount of available Starlight returns to the minimum level, regardless of method. <NL>Replacement or additional constellation papers may also now be crafted.",
  "astralsorcery.journal.CRAFTING_FOCUS_HINT.3.text": "The most dangerous portion of the unlocked knowledge includes the ability to discover the Faint classification of constellations through星圖, though an 瞭望台 will be needed to see them in the sky. The Academy would recommend caution when working with Faint constellations, as their influence can greatly change the expected results of a previously well-known astral mechanic. <NL>-The Faculty and Staff of the Academy of the Astral.",

  "astralsorcery.journal.node.ATT_CAPE.name": "星斗披風",
  "astralsorcery.journal.ATT_CAPE.1.text": "Many magical and technical marvels exist in the realm of personal protection, but none channel the power of the stars. By deeply impregnating leather armor with 星塵 and 共振寶石s, it is transmuted to a mantle of leather and metal that both protects the wearer, and allows for channeling Charge.",
  "astralsorcery.journal.ATT_CAPE.3.text": "Due to the magical sensitivity of a Mantle, it's highly receptive to enchanting. <NL>The receptivity to channeling Starlight means a Mantle cannot be 共鳴via 共鳴祭壇, but instead requires a special crafting operation to attune it to a constellation. <NL>The Mantle cannot be damaged or torn, lest it may not be used in an alignment recipe.",
  "astralsorcery.journal.ATT_CAPE.4.text": "A Mantle may only be aligned to one constellation at a time. Using an already aligned Mantle in another constellation's alignment recipe will change the alignment of the Mantle. <NL>Mantles may be repaired on a mundane anvil using 星塵 as an ingredient. <NL>Alignment recipes are located on each constellation's 星輝寶典 page.",

  "astralsorcery.journal.node.C_CHALICE.name": "遏制聖杯",
  "astralsorcery.journal.C_CHALICE.1.text": "The largest drawback of a 聚星缸 is the reservoir size. While sufficient for generating liquids from a catalyst, the required design becomes prohibitively large when scaled up for greater storage. Pipes that can draw liquid from below the 聚星缸 may not be available, or the environment may not support their use. <NL>Magical teleportation and containment of the fluid is a good solution.",
  "astralsorcery.journal.C_CHALICE.3.text": "Using 共振寶石s to keep the contents under high compression results in 64 buckets of storage in a small space. This also means that relocating a Chalice without first removing the stored fluid will result in the fluid being dispersed into the ether.<NL>The Chalice is able to draw 星能液 through the ether from Lightwells within 16 blocks of its line of sight. Like the 聚星缸, a Chalice can be connected to pipes from the bottom face.",
  "astralsorcery.journal.C_CHALICE.4.text": "As the Chalice facilitates magical transport from Lightwells, the essence of any fluid contained within may leak, seeking out other fluidic essences to merge with. This results in the creation of materials as though the two fluids had met in the world, though very slight dissipation of the stored fluid can occur when this happens. <NL>A redstone signal will tighten the Chalice's compression field, disallowing these effects from happening.",

  "astralsorcery.journal.node.BORE_CORE.name": "萬象泉",
  "astralsorcery.journal.BORE_CORE.1.text": "星能液 may store Starlight energy in a condensed and manageable form, but it is easy to unleash that same power again. Through the use of a magical centrifuge, a chaotic fountain of Starlight can be spun up for times when raw brute magical force are needed to accomplish a goal. <NL>The containment ring of an 萬象泉 serves as a stable focus for these energies, and any blocks left within the structure are likely to be destroyed",
  "astralsorcery.journal.BORE_CORE.3.text": "No view of the sky is needed to operate this device, as it is operated by an internal storage reservoir of 星能液. Safely feeding 星能液 into this reservoir is performed by placing a Chalice directly on top of the Fountain. <NL>The desired magic must first be §5Primed§r for this power to have any effect.",

  "astralsorcery.journal.node.BORE_HEAD_LIQUID.name": "納耳狂曼噴口",
  "astralsorcery.journal.BORE_HEAD_LIQUID.1.text": "Eons of fluidic essence trickling into the void from above bedrock means there are vast, untapped oceans of fluid ripe for retrieval. Using the affinity of南極座 for this fluidic essence allows this Prime to draw it to the surface. <NL>Powering a 納耳狂曼噴口 will result in a highly destructive bore comprised of Starlight energy burning a hole down to bedrock, at which point the energy reacts with the bedrock to reach into the fluidic essence oceans in the ethereal below, dragging it back to the Fountain.",
  "astralsorcery.journal.BORE_HEAD_LIQUID.3.text": "Retrieval of liquids harvested in this way requires an empty Chalice on the line of sight of the Fountain. <NL>Since the majority of fluidic essence available is water, when other reservoirs of essence in the area are exhausted by the Prime, water essence will fill the gap left behind. <NL>An §1艾克斯共振器§r should be used to scout for fluid essence pooling in advance.",
  "astralsorcery.journal.BORE_HEAD_LIQUID.4.text": "With no method to determine which essence is below, moving the Fountain structure constantly is tiresome, and also expensive in 星能液. With some tinkering, the 法斯刻共振器 should be able to sample this information instead.<NL>This improved 艾克斯共振器, drawing on 共振寶石's resonance to fluids, still only works during the night. Shifting modes between the old 法斯刻, and the new 艾克斯, can be accomplished by shift-right-clicking.",

  "astralsorcery.journal.node.ICHOSIC.name": "艾克斯共振器",
  "astralsorcery.journal.ICHOSIC.1.text": "Moving a 納耳狂曼噴口 Fountain structure constantly to determine what fluidic essence lies below is wasteful of effort and time. With some minor changes, the 法斯刻共振器 can be used to sample this information instead. Leveraging 共振寶石s and 星塵, holding the 艾克斯共振器 at night will draw forth plumes of fluidic essence. <NL>Shifting modes between 法斯刻 and 艾克斯 can be accomplished by shift-right-clicking.",

  "astralsorcery.journal.node.BORE_HEAD_VORTEX.name": "費薩利德噴口",
  "astralsorcery.journal.BORE_HEAD_VORTEX.1.text": "Tapping虛御座 for movement allows this Prime to draw close any creatures nearby, trapping them in a vortical current of kinetic Starlight. The trapped creatures remain unable to act or defend themselves while so trapped, for as long as the Fountain has enough 星能液. <NL>The cost in Starlight to restrain a creature is influenced by the strength of that creature to fight against the vortical currents.",
  "astralsorcery.journal.BORE_HEAD_VORTEX.3.text": "Even mythical creatures are capable of being held by this Prime, though it seems to require its full and focused power to do so. These creatures require more Starlight power than a Chalice is able to consistently feed into a Fountain over time. Certain powerful creatures, like the Wither or Ender Dragon, may only be contained until the internal reservoir runs dry.",


  "astralsorcery.journal.recipe.removalinfo": "§c此合成配方已在目前的模租包內移除!請通過其他訊息來源查找合成方式!",
  "astralsorcery.journal.recipe.constellation": "需要與%s星座進行聚焦",

  "astralsorcery.journal.recipe.infusion.liquid": "需要%s",
  "astralsorcery.journal.recipe.infusion.multiple": "可消耗多格液體",
  "astralsorcery.journal.recipe.infusion.no_chalice": "不能接受遏制聖杯的星能液",
  "astralsorcery.journal.recipe.infusion.copy_nbt": "將NBT數據從輸入複製到輸出",
  "astralsorcery.journal.recipe.infusion.chance.format": "消耗液體的機會:%s",
  "astralsorcery.journal.recipe.infusion.chance.low": "少",
  "astralsorcery.journal.recipe.infusion.chance.average": "平均",
  "astralsorcery.journal.recipe.infusion.chance.high": "高",
  "astralsorcery.journal.recipe.infusion.chance.always": "總是",

  "astralsorcery.journal.recipe.altar.upgrade": "將祭壇升級到下一階",
  "astralsorcery.journal.recipe.altar.starlight.desc": "需要星能:",
  "astralsorcery.journal.recipe.altar.starlight.format": "%s: %s",
  "astralsorcery.journal.recipe.altar.starlight.lowest": "幾乎沒有",
  "astralsorcery.journal.recipe.altar.starlight.low": "最少的",
  "astralsorcery.journal.recipe.altar.starlight.avg": "平均的",
  "astralsorcery.journal.recipe.altar.starlight.more": "高於平均的",
  "astralsorcery.journal.recipe.altar.starlight.high": "不少",
  "astralsorcery.journal.recipe.altar.starlight.highest": "大量",
  "astralsorcery.journal.recipe.altar.starlight.toomuch": "太多了",

  "astralsorcery.journal.structure.switch_view": "切換每個Y軸視角",
  "astralsorcery.journal.structure.required_air": "顯示/隱藏 哪個必須是空氣方塊",

  "crystal.info.astralsorcery.attuned": "調整至%s",
  "crystal.info.astralsorcery.trait": "%s的特質",
  "crystal.info.astralsorcery.collect.type": "從%s收集星能",

  "crystal.property.astralsorcery.size.name": "尺寸",
  "crystal.property.astralsorcery.shape.name": "形狀",
  "crystal.property.astralsorcery.purity.name": "純度",
  "crystal.property.astralsorcery.tool.durability.name": "工具耐久值",
  "crystal.property.astralsorcery.tool.efficiency.name": "工具效率值",
  "crystal.property.astralsorcery.ritual.effect.name": "儀式效果",
  "crystal.property.astralsorcery.ritual.range.name": "儀式範圍",
  "crystal.property.astralsorcery.collector.rate.name": "收集率",

  "crystal.property.astralsorcery.constellation.aevitas.name": "聚焦:生息座",
  "crystal.property.astralsorcery.constellation.discidia.name": "聚焦:非攻座",
  "crystal.property.astralsorcery.constellation.armara.name": "聚焦:遁甲座",
  "crystal.property.astralsorcery.constellation.vicio.name": "聚焦:虛御座",
  "crystal.property.astralsorcery.constellation.evorsio.name": "聚焦:解離座",
  "crystal.property.astralsorcery.constellation.lucerna.name": "聚焦:聖芒座",
  "crystal.property.astralsorcery.constellation.mineralis.name": "聚焦:晶金座",
  "crystal.property.astralsorcery.constellation.octans.name": "聚焦:南極座",
  "crystal.property.astralsorcery.constellation.bootes.name": "聚焦:牧夫座",
  "crystal.property.astralsorcery.constellation.horologium.name": "聚焦:時鐘座",
  "crystal.property.astralsorcery.constellation.fornax.name": "聚焦:天爐座",
  "crystal.property.astralsorcery.constellation.pelotrio.name": "聚焦:喚生座",

  "fluid.astralsorcery.liquid_starlight": "星能液",
  "fluid.astralsorcery.liquid_starlight_flowing": "星能液",

  "item.astralsorcery.liquid_starlight_bucket": "星能液桶",

  "item.astralsorcery.aquamarine": "海藍寶石",
  "item.astralsorcery.starmetal_ingot": "星輝錠",
  "item.astralsorcery.stardust": "星塵",
  "item.astralsorcery.glass_lens": "玻璃透鏡",
  "item.astralsorcery.resonating_gem": "共振寶石",
  "item.astralsorcery.parchment": "羊皮紙",
  "item.astralsorcery.concentrated_starlight": "濃縮星能液",
  "item.astralsorcery.concentrated_starlight.broken": "破碎",
  "item.astralsorcery.concentrated_starlight.flawed": "瑕疵",
  "item.astralsorcery.concentrated_starlight.mundane": "平凡",
  "item.astralsorcery.concentrated_starlight.clear": "清澈",
  "item.astralsorcery.concentrated_starlight.gleaming": "閃閃發光",
  "item.astralsorcery.concentrated_starlight.flawless": "完美無瑕",

  "item.astralsorcery.perk_gem_day": "伊利姆寶石",
  "item.astralsorcery.perk_gem_night": "芬格姆芬格姆寶石",
  "item.astralsorcery.perk_gem_sky": "奧瑞姆奧瑞姆寶石",
  "item.astralsorcery.crystal_pickaxe": "水晶石鎬",
  "item.astralsorcery.crystal_shovel": "水晶石鏟",
  "item.astralsorcery.crystal_axe": "水晶石斧",
  "item.astralsorcery.crystal_sword": "水晶石劍",
  "item.astralsorcery.infused_crystal_pickaxe": "聚星水晶石鎬",
  "item.astralsorcery.infused_crystal_shovel": "聚星水晶石鏟",
  "item.astralsorcery.infused_crystal_axe": "聚星水晶石斧",
  "item.astralsorcery.infused_crystal_sword": "聚星水晶石劍",

  "item.astralsorcery.enchantment_amulet": "璀璨棱鏡",
  "item.astralsorcery.tome": "星輝寶典",
  "item.astralsorcery.constellation_paper": "星座圖",
  "item.astralsorcery.knowledge_share": "知識共享捲軸",
  "item.astralsorcery.wand": "共鳴星杖",
  "item.astralsorcery.chisel": "星輝碇切割工具",
  "item.astralsorcery.linking_tool": "連結器",
  "item.astralsorcery.illumination_wand": "照明星杖",
  "item.astralsorcery.hand_telescope": "望遠鏡",
  "item.astralsorcery.architect_wand": "秩序星杖",
  "item.astralsorcery.exchange_wand": "轉位星杖",
  "item.astralsorcery.grapple_wand": "衝擊星杖",
  "item.astralsorcery.blink_wand": "橫行星杖",

  "item.astralsorcery.resonator": "法斯刻共振器",
  "item.astralsorcery.resonator.starlight": "法斯刻共振器",
  "item.astralsorcery.resonator.liquid": "艾克斯共振器",
  "item.astralsorcery.resonator.structure": "多米刻共振器",
  "item.astralsorcery.resonator.upgrade.starlight": "法斯刻",
  "item.astralsorcery.resonator.upgrade.liquid": "艾克斯",
  "item.astralsorcery.resonator.upgrade.structure": "多米刻",
  "item.astralsorcery.infused_glass": "聚星玻璃",
  "item.astralsorcery.infused_glass.active": "蝕刻聚星玻璃",
  "item.astralsorcery.infused_glass.ttip": "- %s%s",
  "item.astralsorcery.infused_glass.ttip.creative": " (創造的) %s%%",

  "item.astralsorcery.mantle": "星斗披風",

  "item.astralsorcery.perk_seal": "封閉印章",
  "item.astralsorcery.illumination_powder": "輝光粉",
  "item.astralsorcery.nocturnal_powder": "暗夜粉",
  "item.astralsorcery.shifting_star": "更替之星",
  "item.astralsorcery.shifting_star_aevitas": "輻射之星",
  "item.astralsorcery.shifting_star_armara": "輻射之星",
  "item.astralsorcery.shifting_star_discidia": "輻射之星",
  "item.astralsorcery.shifting_star_evorsio": "輻射之星",
  "item.astralsorcery.shifting_star_vicio": "輻射之星",

  "item.astralsorcery.colored_lens_fire": "點燃透鏡",
  "item.astralsorcery.colored_lens_break": "破壞透鏡",
  "item.astralsorcery.colored_lens_growth": "生長透鏡",
  "item.astralsorcery.colored_lens_push": "抗拒透鏡",
  "item.astralsorcery.colored_lens_damage": "傷害透鏡",
  "item.astralsorcery.colored_lens_regeneration": "再生透鏡",
  "item.astralsorcery.colored_lens_spectral": "匯聚透鏡",

  "item.astralsorcery.rock_crystal": "水晶石",
  "item.astralsorcery.celestial_crystal": "天體水晶石",
  "item.astralsorcery.attuned_rock_crystal": "共鳴水晶石",
  "item.astralsorcery.attuned_rock_crystal.typed": "%s 共鳴水晶石",
  "item.astralsorcery.attuned_celestial_crystal": "共鳴天體水晶石",
  "item.astralsorcery.attuned_celestial_crystal.typed": "%s 共鳴天體水晶石",

  "block.astralsorcery.marble_raw": "大理石",
  "block.astralsorcery.marble_bricks": "大理石磚",
  "block.astralsorcery.marble_pillar": "大理石柱",
  "block.astralsorcery.marble_chiseled": "雕紋大理石",
  "block.astralsorcery.marble_arch": "大理石橫樑",
  "block.astralsorcery.marble_runed": "精緻大理石",
  "block.astralsorcery.marble_engraved": "凹面大理石",
  "block.astralsorcery.marble_stairs": "大理石樓梯",
  "block.astralsorcery.marble_slab": "大理石半磚",
  "block.astralsorcery.black_marble_raw": "燻黑大理石",
  "block.astralsorcery.black_marble_bricks": "燻黑大理石磚",
  "block.astralsorcery.black_marble_pillar": "燻黑大理石柱",
  "block.astralsorcery.black_marble_chiseled": "雕紋燻黑大理石",
  "block.astralsorcery.black_marble_arch": "燻黑大理石橫樑",
  "block.astralsorcery.black_marble_runed": "精緻燻黑大理石",
  "block.astralsorcery.black_marble_engraved": "凹面燻黑大理石",
  "block.astralsorcery.black_marble_stairs": "燻黑大理石樓梯",
  "block.astralsorcery.black_marble_slab": "燻黑大理石半磚",
  "block.astralsorcery.infused_wood": "聚星木",
  "block.astralsorcery.infused_wood_planks": "聚星木木材",
  "block.astralsorcery.infused_wood_column": "聚星木柱",
  "block.astralsorcery.infused_wood_arch": "聚星木橫樑",
  "block.astralsorcery.infused_wood_engraved": "凹面聚星木",
  "block.astralsorcery.infused_wood_enriched": "刻紋聚星木",
  "block.astralsorcery.infused_wood_infused": "拋光聚星木",
  "block.astralsorcery.infused_wood_stairs": "聚星木樓梯",
  "block.astralsorcery.infused_wood_slab": "聚星木半磚",

  "block.astralsorcery.rock_crystal_ore": "水晶石原礦",
  "block.astralsorcery.aquamarine_sand_ore": "海藍寶石砂岩",
  "block.astralsorcery.starmetal_ore": "星輝碇原礦",
  "block.astralsorcery.starmetal": "星輝碇塊",
  "block.astralsorcery.glow_flower": "微光莧",

  "block.astralsorcery.rock_collector_crystal": "聚能水晶",
  "block.astralsorcery.rock_collector_crystal.typed": "%s 聚能水晶",
  "block.astralsorcery.celestial_collector_crystal": "天體聚能水晶",
  "block.astralsorcery.celestial_collector_crystal.typed": "%s 天體聚能水晶",

  "block.astralsorcery.spectral_relay": "光波增幅器",
  "block.astralsorcery.altar_discovery": "星輝合成台",
  "block.astralsorcery.altar_attunement": "共鳴祭壇",
  "block.astralsorcery.altar_constellation": "天輝祭壇",
  "block.astralsorcery.altar_radiance": "五彩祭壇",
  "block.astralsorcery.altar_brilliance": "輝煌祭壇",
  "block.astralsorcery.attunement_altar": "共鳴祭壇",
  "block.astralsorcery.chalice": "遏制聖杯",
  "block.astralsorcery.celestial_gateway": "天體星門",
  "block.astralsorcery.illuminator": "洞穴照明器",
  "block.astralsorcery.infuser": "星能聚合器",
  "block.astralsorcery.lens": "水晶透鏡",
  "block.astralsorcery.observatory": "瞭望台",
  "block.astralsorcery.prism": "水晶棱鏡",
  "block.astralsorcery.refraction_table": "群星映射台",
  "block.astralsorcery.tree_beacon": "烽火樹",
  "block.astralsorcery.ritual_link": "儀式連結器",
  "block.astralsorcery.ritual_pedestal": "效應放大器",
  "block.astralsorcery.telescope": "天文望遠鏡",
  "block.astralsorcery.well": "聚星缸",
  "block.astralsorcery.celestial_crystal_cluster": "天體水晶簇",
  "block.astralsorcery.gem_crystal_cluster": "寶石水晶簇",
  "block.astralsorcery.gem_crystal_cluster.day": "伊利姆水晶簇",
  "block.astralsorcery.gem_crystal_cluster.night": "芬格姆水晶簇",
  "block.astralsorcery.gem_crystal_cluster.sky": "奧瑞姆水晶簇",
  "block.astralsorcery.singularity": "阿尼瑪奇點",
  "block.astralsorcery.fountain": "萬象泉",
  "block.astralsorcery.fountain_prime_liquid": "納耳狂曼噴口",
  "block.astralsorcery.fountain_prime_vortex": "費薩利德噴口",
  "block.astralsorcery.fountain_prime_ore": "佩卓曼蒂噴口",

  "astralsorcery.journal.constellation.enchantments": "群星映射台:",
  "astralsorcery.journal.constellation.ritual": "儀式效果:",
  "astralsorcery.journal.constellation.ritual.trait": "儀式特質修改:",
  "astralsorcery.journal.constellation.mantle": "披風效果:",
  "astralsorcery.journal.constellation.corruption": "損壞的儀式效果:",

  "astralsorcery.journal.constellation.type.major": "明亮",
  "astralsorcery.journal.constellation.type.weak": "黯淡",
  "astralsorcery.journal.constellation.type.minor": "微弱",
  "astralsorcery.journal.constellation.unknown": "? ? ?",

  "astralsorcery.constellation.discidia": "非攻座",
  "astralsorcery.constellation.discidia.tag": "攻擊性的",
  "astralsorcery.constellation.discidia.description": "來自這個星座的光穿透，穿透到物質和生物。",
  "astralsorcery.constellation.discidia.enchantments": "星之釀大大增加了力量。武器附有強力，鋒利或者喚雷。<NL>附魔武器的整體傷害也可能會增加。 非進攻座附魔的裝備可能會增加爆擊機率。",
  "astralsorcery.constellation.discidia.ritual": "星座的光芒會形成一個破壞場，對附近的所有敵人造成強烈傷害。強度增加取決於引導儀式中使用的星光數量。",
  "astralsorcery.constellation.discidia.mantle": "披風會反彈傷害，並且每當佩戴者獲得新的傷害，穿戴者攻擊時就能將自己所受到的傷害轉變為對怪物的額外傷害。",
  "astralsorcery.constellation.discidia.corruption": "進攻性武器變成了增強敵人的武器。 盟友會發現自己受傷，敵人會同時有回復和抗性。",

  "astralsorcery.constellation.armara": "遁甲座",
  "astralsorcery.constellation.armara.tag": "防禦性的",
  "astralsorcery.constellation.armara.description": "斥力來自這個星座的光，類似於屏蔽或保護性屏障。",
  "astralsorcery.constellation.armara.enchantments": "星之釀授予抵抗傷害的能力。 護甲會附有沉重的附魔保護。<NL>護甲也可能會有超出其常規的附魔保護範圍。 附魔的武器可以提高持守者閃避來襲打擊的能力。",
  "astralsorcery.constellation.armara.ritual": "星座的光芒形成保護性屏障中會反射投射物，將小怪推到其無法觸及的範圍，並使盟友更容易抵抗傷害。此頻率增加取決於引導儀式中使用的星光數量。",
  "astralsorcery.constellation.armara.mantle": "在一分鐘內緩慢地存儲多達三個星能充能，每一次都完全消除了一個有害的打擊。",
  "astralsorcery.constellation.armara.corruption": "保護變成了攻擊，以前被擊退的生物現在被賦予了速度，力量和抵抗力。",

  "astralsorcery.constellation.vicio": "虛御座",
  "astralsorcery.constellation.vicio.tag": "運動中的",
  "astralsorcery.constellation.vicio.description": "沐浴在這個星座的光線中，一切都變慢，而使您變得更快。",
  "astralsorcery.constellation.vicio.enchantments": "星之釀大大提高了移動速度。 附魔靴子有減少掉落的傷害， 三叉戟會有波濤附魔。<NL>武器的攻擊速度會提高，靴子會有加速移動。",
  "astralsorcery.constellation.vicio.ritual": "這個星座的光芒賦予區域內飛行。 最大的飛行距離取決於引導儀式中使用的星光數量。",
  "astralsorcery.constellation.vicio.mantle": "披風給予使佩戴者空靈的翅膀，讓佩戴者像鞘翅一樣飛行，但是速度更快，並且沒有任何使用損壞。",
  "astralsorcery.constellation.vicio.corruption": "空氣阻礙儀式內部人員的行動，導致飛行失能，並造成巨大的緩慢和採礦疲勞。",

  "astralsorcery.constellation.aevitas": "生息座",
  "astralsorcery.constellation.aevitas.tag": "創造性的",
  "astralsorcery.constellation.aevitas.description": "暴露在此星座的聚焦光下會導致附近的生活蓬勃發展，並大大增加其產量。",
  "astralsorcery.constellation.aevitas.enchantments": "星之釀授予回復。 附魔的裝備和工具可以讓他們神奇地修復自身的損壞。<NL>附魔的盔甲也可能會增加穿戴者的生命值，附魔的武器可能會削弱敵人的生命值。",
  "astralsorcery.constellation.aevitas.ritual": "儀式充斥著充滿活力的生命-附近的生物擁有回復，而附近的農作物以加速的速度生長。 此頻率增加取決於引導儀式中使用的星光數量。",
  "astralsorcery.constellation.aevitas.mantle": "沐浴在創造的力量中，穿著此披風可滿足穿戴者對食物的需求，並帶來更快的癒合。在方塊行走時披風使你浮在空中，就像在空氣中行走一樣。( Walking off of blocks causes the mantle to hold you aloft, as if walking on thin air.)",
  "astralsorcery.constellation.aevitas.corruption": "創造的光變成了衰變，生物消耗生命和力量，植物分解成了灰塵。",

  "astralsorcery.constellation.evorsio": "解離座",
  "astralsorcery.constellation.evorsio.tag": "破壞性的",
  "astralsorcery.constellation.evorsio.description": "這個星座的光可以穿透材料和物體。",
  "astralsorcery.constellation.evorsio.enchantments": "星之釀增加挖掘和攻擊速度。 附魔工具提高其使用效率。<NL>此外，挖掘工具在挖掘適用方塊時可能會提高速度。",
  "astralsorcery.constellation.evorsio.ritual": "儀式的光線會徹底的破壞，破壞除了無法破壞的方塊之外的所有方塊。方塊打破的速度會增加取決於引導儀式中使用的星光數量。",
  "astralsorcery.constellation.evorsio.mantle": "這種披風增強了您的破壞力，使您可以立即破壞大範圍的方塊。",
  "astralsorcery.constellation.evorsio.corruption": "破壞變成了創造，空氣變成了塵土，石頭或有時是礦石。",

  "astralsorcery.constellation.mineralis": "晶金座",
  "astralsorcery.constellation.mineralis.tag": "礦物質",
  "astralsorcery.constellation.mineralis.description": "在這個星座的光芒照耀下，石頭會發出奇怪的光，其形狀會隨著時間而改變。",
  "astralsorcery.constellation.mineralis.enchantments": "星之釀增加挖掘和攻擊速度。 附魔的工具會有幸運加成。<NL>此外，附魔的裝備可以提高工具效率，挖掘工具距離提高。",
  "astralsorcery.constellation.mineralis.ritual": "這個星座的光在大範圍內將普通的石頭變成了有價值的礦物。 石頭變異的機率取決於引導儀式中使用的星光數量。",
  "astralsorcery.constellation.mineralis.mantle": "披風會被尋找的材料所吸引，無論何地，任隻手握住的方塊都會露出此方塊在二十個方塊半徑內的位置。",
  "astralsorcery.constellation.mineralis.corruption": "利潤豐厚的礦物變為廢物, 空氣在走路者下方變成石頭。",

  "astralsorcery.constellation.lucerna": "聖芒座",
  "astralsorcery.constellation.lucerna.tag": "光亮",
  "astralsorcery.constellation.lucerna.description": "儘管這個星座離你很遙遠，但它的光線非常明亮。甚至亮到在其區域內無法生成其他敵對生物。",
  "astralsorcery.constellation.lucerna.enchantments": "星之釀賦予在黑暗中看見的能力。附過魔的頭盔也能達到相同的效果。<NL>聖芒座附魔的裝備可以增加佩戴者的星能充能最大值, 武器和工具可以改善星能充能的回復。",
  "astralsorcery.constellation.lucerna.ritual": "雖然只有星光，除非怪物足夠強大，儀式區域內包含的基本亮度可以防止生物在黑暗中出現。 儀式的範圍會根據在儀式上活躍的透鏡的數量而增加。",
  "astralsorcery.constellation.lucerna.mantle": "這個披風無視牆壁的揭示了在36個方塊半徑內的所有生物，包含生怪箱。",
  "astralsorcery.constellation.lucerna.corruption": "日光被拋棄，星光的時間持續更長的時間。",

  "astralsorcery.constellation.horologium": "時鐘座",
  "astralsorcery.constellation.horologium.tag": "時間",
  "astralsorcery.constellation.horologium.description": "這個星座隱匿於時間之中。不僅很難發現，它的光線似乎能扭曲時間，在它的光芒下時間飛速流逝。",
  "astralsorcery.constellation.horologium.enchantments": "星之釀增加運動速度，挖掘加速，並大大增加運氣。 附魔武器在被殺死的敵人中會發現更多戰利品，並且工具可能會為其使用者帶來更多物資。<NL>附魔的工具和武器可能會發現自己冷卻速度減少， 頭盔會增加星能力XP量，而盔甲可能會提高星能力的效果。",
  "astralsorcery.constellation.horologium.ritual": "儀式加快了所有機械的速度，附近的機械以自己的時鐘增加速度。 機械的時鐘前進的速度取決於引導儀式中使用的星光數量。",
  "astralsorcery.constellation.horologium.mantle": "披風穿戴者受到攻擊可以短時間凍結附近的所有敵人。此能力會冷卻一段時間。 火不會受到影響。",
  "astralsorcery.constellation.horologium.corruption": "附近的生物和方塊處於停滯狀態，就好像被時間凍結了一樣。",

  "astralsorcery.constellation.octans": "南極座",
  "astralsorcery.constellation.octans.tag": "海洋",
  "astralsorcery.constellation.octans.description": "將這個星座的光反射到水上會產生奇怪的氣泡，水看起充滿了活力。",
  "astralsorcery.constellation.octans.enchantments": "星之釀使飲者在海底呼吸和看見。附魔頭盔可以增強使用者的水下呼吸。<NL>附魔頭盔可以提高游泳速度。",
  "astralsorcery.constellation.octans.ritual": "這個星座的光線改善了釣魚時的收成，並將魚和其他物體拉到水面。 這在海洋中使用時效果最好，收穫發生的頻率取決於引導儀式中使用的星光數量。",
  "astralsorcery.constellation.octans.mantle": "注入了這種星座的披風使在水裡的移動變得像在空中一樣輕鬆，賦予了水下呼吸和無視水阻力的使用工具和武器的能力。",
  "astralsorcery.constellation.octans.corruption": "海洋暴動，基座周圍形成海，暴亂的魚從天而降，附近的其他液體乾燥成沙。",

  "astralsorcery.constellation.bootes": "牧夫座",
  "astralsorcery.constellation.bootes.tag": "畜牧",
  "astralsorcery.constellation.bootes.description": "這些柔和的光線使動物保持快樂和健康。",
  "astralsorcery.constellation.bootes.enchantments": "星之釀使飢餓感得到滿足。附魔的工具會有絲綢之觸，三叉戟會向投擲者忠誠。<NL>附魔的盔甲可以增加穿戴者的健康，近戰武器也可以從更遠的地方打擊敵人。",
  "astralsorcery.constellation.bootes.ritual": "沐浴在這個星座光照下的可放牧動物放鬆並活躍，並神奇地產出它們的產品。 這種情況的發生頻率取決於引導儀式中使用的星光數量。",
  "astralsorcery.constellation.bootes.mantle": "穿上此種披風，會召喚三個耀斑跟隨你，攻擊任何先攻擊你的敵人。",
  "astralsorcery.constellation.bootes.corruption": "照顧變成屠殺，周圍的野外的生物被儀式屠殺，留下了資源。",

  "astralsorcery.constellation.fornax": "天爐座",
  "astralsorcery.constellation.fornax.tag": "高溫",
  "astralsorcery.constellation.fornax.description": "這束星輝上帶有強大的力量和劇烈的熱量，僅僅是注視著就感到口乾舌燥。",
  "astralsorcery.constellation.fornax.enchantments": "星之釀以賦予抗火性。附魔武器會將敵人燃燒，工具將熔化並燒焦其開采的方塊。<NL>附魔的武器可能更容易造成暴擊。 附魔的裝甲可以提高爆擊的強度。",
  "astralsorcery.constellation.fornax.ritual": "用儀式的力量熱量分散到更大的地方能防止因雷擊而引起的火災，缺點就是附近的方塊可能會被燒焦或熔化。其速度取決於引導的星光的數量。",
  "astralsorcery.constellation.fornax.mantle": "穿上這種外衣時，火和熔岩會修補並癒合使用者的肉，而不是造成傷害。",
  "astralsorcery.constellation.fornax.corruption": "高溫使該區域逃逸，液體凍結，大火撲滅，空氣中的濕氣凍結成固體冰塊。",

  "astralsorcery.constellation.pelotrio": "喚生座",
  "astralsorcery.constellation.pelotrio.tag": "召集",
  "astralsorcery.constellation.pelotrio.description": "這個星座的非自然力量不可抗拒，僅僅在最黑暗或最明亮的夜晚才能被發覺。",
  "astralsorcery.constellation.pelotrio.enchantments": "星之釀給予改善健康再生和受損的吸收。附魔的釣魚竿引誘魚類，弓箭永遠不會耗盡箭矢。<NL>附魔的裝甲可以延長消耗藥水的持續時間，也可以增加躲閃的機率。",
  "astralsorcery.constellation.pelotrio.ritual": "不論聖芒座附近是否有燈光，被此星座的散射光所浸沒的區域將帶來各種各樣的生命。。 根據引導到儀式中的星光的數量，這種召喚的頻率會增加。",
  "astralsorcery.constellation.pelotrio.mantle": "此種星斗披風通常會將星輝轉變為工具形態，它將模仿穿戴者的行為，用鎬挖掘方塊，用斧砍倒樹，或用武器攻擊敵人。",
  "astralsorcery.constellation.pelotrio.corruption": "內心的黑暗被呼喚，從附近的生物爆發並扭曲成可怕的黑暗形式。 這些生物被殺死時，會有大量戰利品從它們身上爆發出來。",

  "astralsorcery.constellation.gelu": "寒冰座",
  "astralsorcery.constellation.gelu.tag": "寒冷的",
  "astralsorcery.constellation.gelu.description": "星芒的極寒與這個冰冷星座的超自然力量相互呼應。",
  "astralsorcery.constellation.gelu.enchantments": "星之釀時能提高火焰和傷害保護。 但會使使用者緩速. 附魔的靴子可以凍結走過的水面，減少墜落損壞。 附魔物品損壞機率變低。<NL>附魔的裝甲可以提高結界的力量，挖掘工具的作用範圍更大，武器的致命一擊也更強大。",
  "astralsorcery.constellation.gelu.trait": "隨著它內部的嚴寒逐漸擴散而使其內的寒意降低， 因此它的傳播範圍也擴大了，儀式的影響範圍擴大了近四倍，但強度卻降低了近六分之一。",

  "astralsorcery.constellation.ulteria": "避役座",
  "astralsorcery.constellation.ulteria.tag": "頑強的",
  "astralsorcery.constellation.ulteria.description": "這個星座的光芒十分穩定，即使穿過十分遙遠的距離也凝而不散，如同一位不可阻擋的超凡存在。",
  "astralsorcery.constellation.ulteria.enchantments": "喝下星之釀以犧牲輸出力量為代價，提供卓越的傷害吸收和再生能力。附魔物品可以抵抗使用造成的傷害，附魔的盔甲可以神奇地減少火，投射物和爆炸的傷害。<NL>附魔的裝甲可以進一步減少元素傷害，近戰武器可以反映對攻擊者的傷害，而遠程武器則可以提高躲閃的能力。",
  "astralsorcery.constellation.ulteria.trait": "貼近儀式的能源，它的力量超過四倍增加，但收縮到五分之一正常大小。",

  "astralsorcery.constellation.alcara": "振變座",
  "astralsorcery.constellation.alcara.tag": "共鳴的",
  "astralsorcery.constellation.alcara.description": "宇宙中的萬物都與它們存在著微弱的依存關係，這個星座的光芒能夠打斷它們之間的因果關係轉化為其扭轉為另一種結果。",
  "astralsorcery.constellation.alcara.enchantments": "這個星座的星之釀大大增強了運氣，飲用後擁有隱身的效果，並提高了移動速度。 附魔的釣魚竿在所有方面都更加有效，工具輕柔地挖掘，劍對目標有破壞力更大，十字弓更容易裝填。<NL>裝甲可能會增加穿戴者的衝刺時間，近戰武器可能會留下流血的傷口，遠程武器可能會飛得更快。",
  "astralsorcery.constellation.alcara.trait": "共鳴水晶石斷裂機率增加。另外,原來的放大效應會被破壞,產生負面作用。",

  "astralsorcery.constellation.vorux": "貪狼座",
  "astralsorcery.constellation.vorux.tag": "兇猛的",
  "astralsorcery.constellation.vorux.description": "即使從星界的深處，這個星座的光喚起眾生的憤怒和侵略。",
  "astralsorcery.constellation.vorux.enchantments": "這個星座的星之釀經常被勇氣藥水，以疲勞為代價，以增強攻擊強度和抵抗力。附魔的武器會以各種方式對目標造成更大的傷害，十字弓會刺穿目標和盾牌，刺傷後面的目標。<NL>附魔的盔甲可以提高穿戴者的移動速度。",
  "astralsorcery.constellation.vorux.trait": "兩端燃燒蠟燭可提供更多照明，但會更快地導致黑暗。 儀式的力量和影響力幾乎增加了一倍，但損壞將更快地發生。",

  "perk.info.astralsorcery.locked": "鎖定",
  "perk.info.astralsorcery.available": "可用",
  "perk.info.astralsorcery.active": "啟用",
  "perk.info.astralsorcery.points": "可用技能點數:%s",
  "perk.info.astralsorcery.missing_progress": "你無權掌握星能力.",
  "perk.info.astralsorcery.sealed": "已封印",
  "perk.info.astralsorcery.sealed.break": "[雙擊解封]",
  "perk.info.astralsorcery.sealed.usage": "將封閉印章拖曳到你想封印的能力上.",
  "perk.info.astralsorcery.gem.empty": "空的寶石嵌槽",
  "perk.info.astralsorcery.gem.remove": "右鍵移除寶石並放入你的背包.",
  "perk.info.astralsorcery.gem.content.item": "鑲嵌的寶石:%s",
  "perk.info.astralsorcery.gem.content.empty": "右鍵選擇你背包內的寶石.",
  "perk.info.astralsorcery.gem.content.empty.none": "你背包裡沒有寶石!",

  "perk.category.astralsorcery.root.name": "根源星能力",
  "perk.category.astralsorcery.major.name": "主要星能力",
  "perk.category.astralsorcery.key.name": "關鍵星能力",
  "perk.category.astralsorcery.epiphany.name": "稀有星能力",
  "perk.category.astralsorcery.focus.name": "焦點星能力",

  "perk.reader.astralsorcery.infostar": "統計數據",
  "perk.reader.astralsorcery.gui": "星能力統計",
  "perk.reader.astralsorcery.limit.default": "(限制為%s)",
  "perk.reader.astralsorcery.limit.percent": "(限制為%s%%)",
  "perk.reader.astralsorcery.postprocess.default": "強制為%s",

  "perk.reader.astralsorcery.description.head": "B %s",
  "perk.reader.astralsorcery.description.addition": "A + %s",
  "perk.reader.astralsorcery.description.increase": "I   * %s",
  "perk.reader.astralsorcery.description.moreless": "M     * %s",

  "perk.modifier.astralsorcery.format": "%%1$s%%2$s %%3$s",
  "perk.modifier.astralsorcery.format.thorns": "%%1$s%%3$s",
  "perk.modifier.astralsorcery.format.lifeleech": "%%1$s%%3$s",

  "perk.modifier.astralsorcery.addition.add": " 增加",
  "perk.modifier.astralsorcery.addition.sub": " 到",
  "perk.modifier.astralsorcery.added_multiply.add": "%% 增加的",
  "perk.modifier.astralsorcery.added_multiply.sub": "%% 減少的",
  "perk.modifier.astralsorcery.stacking_multiply.add": "%% 額外增加的",
  "perk.modifier.astralsorcery.stacking_multiply.sub": "%% 額外減少的",

  "perk.attribute.astralsorcery.thorns.modifier.name": "%% 近戰傷害反彈率",
  "perk.attribute.astralsorcery.lifeleech.modifier.name": "%% 的傷害輸出轉換為生命值",

  "perk.attribute.astralsorcery.meleeattackdamage.name": "近戰傷害",
  "perk.attribute.astralsorcery.projectileattackdamage.name": "投射物傷害",
  "perk.attribute.astralsorcery.projectilespeed.name": "投射物速度",
  "perk.attribute.astralsorcery.maxhealth.name": "最大生命值",
  "perk.attribute.astralsorcery.movespeed.name": "移動速度",
  "perk.attribute.astralsorcery.swimspeed.name": "游泳速度",
  "perk.attribute.astralsorcery.armor.name": "護甲",
  "perk.attribute.astralsorcery.armortoughness.name": "護甲韌性",
  "perk.attribute.astralsorcery.attackspeed.name": "攻擊速度",
  "perk.attribute.astralsorcery.reach.name": "手長",
  "perk.attribute.astralsorcery.dynenchantmenteffect.name": "璀璨棱鏡附魔等級",

  "perk.attribute.astralsorcery.liferecovery.name": "生命回复",
  "perk.attribute.astralsorcery.potionduration.name": "藥水效果時間",
  "perk.attribute.astralsorcery.bleedduration.name": "流血時間",
  "perk.attribute.astralsorcery.bleedamount.name": "最大流血量",
  "perk.attribute.astralsorcery.bleedchance.name": "流血率",
  "perk.attribute.astralsorcery.rampageduration.name": "無敵時間",
  "perk.attribute.astralsorcery.perkeffect.name": "星能力效果",
  "perk.attribute.astralsorcery.harvestspeed.name": "挖掘速度",
  "perk.attribute.astralsorcery.critchance.name": "暴擊機率",
  "perk.attribute.astralsorcery.critmulti.name": "暴擊傷害倍數",
  "perk.attribute.astralsorcery.allres.name": "元素抗性",
  "perk.attribute.astralsorcery.expgain.name": "星能力經驗值獲取",
  "perk.attribute.astralsorcery.dodge.name": "躲避機率",
  "perk.attribute.astralsorcery.thorns.name": "傷害反彈",
  "perk.attribute.astralsorcery.lifeleech.name": "生命竊取",
  "perk.attribute.astralsorcery.chargeregeneration.name": "星能恢復率",
  "perk.attribute.astralsorcery.chargecap.name": "最大星能值",
  "perk.attribute.astralsorcery.miningsize.name": "挖掘尺寸",
  "perk.attribute.astralsorcery.cooldown_reduction.name": "冷卻恢復",
  "perk.attribute.astralsorcery.luck.name": "幸運",

  "perk.astralsorcery.generic.add.allres.name": "增加元素抗性",
  "perk.astralsorcery.generic.add.dodge.name": "增加閃避機率",
  "perk.astralsorcery.generic.add.reach.name": "增加手長",
  "perk.astralsorcery.generic.add.armor.name": "增加護甲",
  "perk.astralsorcery.generic.add.armor_toughness.name": "增加護甲韌性",
  "perk.astralsorcery.generic.add.life.name": "增加最大生命",
  "perk.astralsorcery.generic.add.life_recovery.name": "增加生命回復",
  "perk.astralsorcery.generic.add.life_leech.name": "增加生命竊取",
  "perk.astralsorcery.generic.add.proj_speed.name": "增加投射物速度",
  "perk.astralsorcery.generic.add.damage_proj.name": "增加投射物傷害",
  "perk.astralsorcery.generic.add.attack_speed.name": "增加攻擊速度",
  "perk.astralsorcery.generic.add.damage_melee.name": "增加近戰傷害",
  "perk.astralsorcery.generic.add.mining_speed.name": "增加挖掘速度",
  "perk.astralsorcery.generic.add.mining_size.name": "增加挖掘尺寸",
  "perk.astralsorcery.generic.add.crit_chance.name": "增加暴擊機率",
  "perk.astralsorcery.generic.add.crit_multiplier.name": "增加暴擊傷害倍數",
  "perk.astralsorcery.generic.add.move_speed.name": "增加移動速度",
  "perk.astralsorcery.generic.add.swim_speed.name": "增加游泳速度",
  "perk.astralsorcery.generic.add.perk_effect.name": "增加星能力效果",
  "perk.astralsorcery.generic.add.perk_exp.name": "增加星能力經驗值",
  "perk.astralsorcery.generic.add.potion_duration.name": "增加藥水時間",
  "perk.astralsorcery.generic.add.starlight_charge_max.name": "增加最大星能",
  "perk.astralsorcery.generic.add.starlight_charge_regen.name": "增加星能恢復",
  "perk.astralsorcery.generic.add.thorns.name": "增加反彈傷害",
  "perk.astralsorcery.generic.add.bleed_duration.name": "增加流血時間",
  "perk.astralsorcery.generic.add.bleed_chance.name": "增加流血機率",
  "perk.astralsorcery.generic.add.bleed_stacks.name": "增加流血量",
  "perk.astralsorcery.generic.add.rampage_duration.name": "增加無敵時間",
  "perk.astralsorcery.generic.add.luck.name": "增加幸運",

  "perk.astralsorcery.generic.inc.allres.name": "提升元素抗性",
  "perk.astralsorcery.generic.inc.dodge.name": "提升閃避機率",
  "perk.astralsorcery.generic.inc.reach.name": "提升手長",
  "perk.astralsorcery.generic.inc.armor.name": "提升護甲",
  "perk.astralsorcery.generic.inc.armor_toughness.name": "提升護甲韌性",
  "perk.astralsorcery.generic.inc.life.name": "提升最大生命",
  "perk.astralsorcery.generic.inc.life_recovery.name": "提升生命回復",
  "perk.astralsorcery.generic.inc.life_leech.name": "提升生命竊取",
  "perk.astralsorcery.generic.inc.proj_speed.name": "提升投射物速度",
  "perk.astralsorcery.generic.inc.damage_proj.name": "提升投射物傷害",
  "perk.astralsorcery.generic.inc.attack_speed.name": "提升攻擊速度",
  "perk.astralsorcery.generic.inc.damage_melee.name": "提升近戰傷害",
  "perk.astralsorcery.generic.inc.mining_speed.name": "提升挖掘速度",
  "perk.astralsorcery.generic.inc.mining_size.name": "提升挖掘尺寸",
  "perk.astralsorcery.generic.inc.crit_chance.name": "提升暴擊機率",
  "perk.astralsorcery.generic.inc.crit_multiplier.name": "提升暴擊傷害倍數",
  "perk.astralsorcery.generic.inc.move_speed.name": "提升移動速度",
  "perk.astralsorcery.generic.inc.swim_speed.name": "提升游泳速度",
  "perk.astralsorcery.generic.inc.perk_effect.name": "提升星能力效果",
  "perk.astralsorcery.generic.inc.perk_exp.name": "提升星能力經驗值",
  "perk.astralsorcery.generic.inc.potion_duration.name": "提升藥水時間",
  "perk.astralsorcery.generic.inc.starlight_charge_max.name": "提升最大星能",
  "perk.astralsorcery.generic.inc.starlight_charge_regen.name": "提升星能恢復",
  "perk.astralsorcery.generic.inc.thorns.name": "提升反彈傷害",
  "perk.astralsorcery.generic.inc.bleed_duration.name": "提升流血時間",
  "perk.astralsorcery.generic.inc.bleed_chance.name": "提升流血機率",
  "perk.astralsorcery.generic.inc.bleed_stacks.name": "提升流血量",
  "perk.astralsorcery.generic.inc.rampage_duration.name": "提升無敵時間",
  "perk.astralsorcery.generic.inc.cooldown_reduction.name": "提升冷卻恢復",
  "perk.astralsorcery.generic.inc.ench_effect.name": "提升璀璨棱鏡效果",
  "perk.astralsorcery.generic.inc.luck.name": "提升幸運",

  "perk.astralsorcery.hybrid.life_armor.name": "生命和護甲",
  "perk.astralsorcery.hybrid.life_reach.name": "生命和手長",
  "perk.astralsorcery.hybrid.life_movespeed.name": "移動速度和生命",
  "perk.astralsorcery.hybrid.life_attackspeed.name": "攻擊速度和生命",
  "perk.astralsorcery.hybrid.life_starlight_charge.name": "生命和星能恢復",
  "perk.astralsorcery.hybrid.life_cooldown_reduction.name": "生命和冷卻恢復",
  "perk.astralsorcery.hybrid.life_recovery_cooldown_reduction.name": "生命回復和冷卻回復",
  "perk.astralsorcery.hybrid.melee_proj_dmg.name": "近戰和投射物傷害",
  "perk.astralsorcery.hybrid.melee_crit_chance.name": "近戰和暴擊機率",
  "perk.astralsorcery.hybrid.reach_mining.name": "手長和挖掘速度",
  "perk.astralsorcery.hybrid.reach_movespeed.name": "手長和移動速度",
  "perk.astralsorcery.hybrid.charge_max_regen.name": "星能最大值和恢復",
  "perk.astralsorcery.hybrid.charge_regen_mining.name": "星能恢復和挖掘速度",
  "perk.astralsorcery.hybrid.armor_armor_toughness.name": "護甲與護甲韌性",
  "perk.astralsorcery.hybrid.attack_speed_rampage.name": "無敵時間和攻擊速度",
  "perk.astralsorcery.hybrid.proj_dmg_speed.name": "投射物傷害和速度",
  "perk.astralsorcery.hybrid.charge_all_resist.name": "星能最大值和元素抗性",

  "perk.astralsorcery.gem_socket.name": "寶石插槽",

  "perk.astralsorcery.named.thick_skin.name": "強化之膚",
  "perk.astralsorcery.named.melding.name": "融會貫通",
  "perk.astralsorcery.named.swiftness.name": "秘能迅捷",
  "perk.astralsorcery.named.agility.name": "靈活敏捷",
  "perk.astralsorcery.named.resilience.name": "自然抵抗",
  "perk.astralsorcery.named.bulwark.name": "神幻壁壘",
  "perk.astralsorcery.named.strong_arms.name": "強壯手臂",
  "perk.astralsorcery.named.deadly_draw.name": "致命箭矢",
  "perk.astralsorcery.named.expertise.name": "超群身法",
  "perk.astralsorcery.named.tunneling.name": "穿越隧道",
  "perk.astralsorcery.named.stellar_vessel.name": "恆星之船",
  "perk.astralsorcery.named.ample_semblance.name": "充足外貌",
  "perk.astralsorcery.named.iron_heart.name": "鐵石心腸",
  "perk.astralsorcery.named.zeal.name": "熱情如火",
  "perk.astralsorcery.named.haste.name": "電光火石",
  "perk.astralsorcery.named.tough.name": "堅忍不拔",
  "perk.astralsorcery.named.combat_focus.name": "專精作戰",
  "perk.astralsorcery.named.bloom.name": "盛開綻放",
  "perk.astralsorcery.named.illusory_hammer.name": "虛幻之錘",
  "perk.astralsorcery.named.alchemists_flasks.name": "煉金燒瓶",
  "perk.astralsorcery.named.profane_chemistry.name": "褻瀆化學",
  "perk.astralsorcery.named.tilted_pendulum.name": "傾斜鐘擺",
  "perk.astralsorcery.named.vampirism.name": "吸血鬼",
  "perk.astralsorcery.named.precision.name": "縝密精確",
  "perk.astralsorcery.named.focused_mind.name": "心神合一",
  "perk.astralsorcery.named.cunning.name": "奸詐狡猾",
  "perk.astralsorcery.named.prismatic_shimmer.name": "閃耀棱鏡",
  "perk.astralsorcery.named.vitality.name": "生命活力",
  "perk.astralsorcery.named.sage.name": "智者",
  "perk.astralsorcery.named.vivid_growth.name": "蓬勃發展",
  "perk.astralsorcery.named.adaptive.name": "隨遇而安",
  "perk.astralsorcery.named.fleet_footed.name": "腳底抹油",
  "perk.astralsorcery.named.dazzling_barrier.name": "耀眼屏障",
  "perk.astralsorcery.named.hushed_steps.name": "寂靜步伐",
  "perk.astralsorcery.named.dervish.name": "苦行僧",
  "perk.astralsorcery.named.clarity.name": "頭腦清晰",
  "perk.astralsorcery.named.osmosis.name": "滲透",
  "perk.astralsorcery.named.arrow_slits.name": "暗箭難防",
  "perk.astralsorcery.named.finesse.name": "巧奪天工",
  "perk.astralsorcery.named.lethality.name": "致命一擊",
  "perk.astralsorcery.named.geologic_prowess.name": "大地英豪",

  "perk.astralsorcery.aevitas.name": "根源:生息座",
  "perk.astralsorcery.aevitas.desc": "透過放置方塊獲得經驗",
  "perk.astralsorcery.vicio.name": "根源:虛御座",
  "perk.astralsorcery.vicio.desc": "透過移動獲得經驗",
  "perk.astralsorcery.evorsio.name": "根源:解離座",
  "perk.astralsorcery.evorsio.desc": "透過破壞方塊獲得經驗",
  "perk.astralsorcery.discidia.name": "根源:非攻座",
  "perk.astralsorcery.discidia.desc": "透過造成傷害獲得經驗",
  "perk.astralsorcery.armara.name": "根源:遁甲座",
  "perk.astralsorcery.armara.desc": "透過受到傷害獲得經驗",

  "perk.astralsorcery.key.cleansing.name": "淨化",
  "perk.astralsorcery.key.cleansing.desc": "生命恢復可能消除負面效果",
  "perk.astralsorcery.key.plant_growth.name": "欣欣向榮",
  "perk.astralsorcery.key.plant_growth.desc": "你周圍的植物生長迅速",
  "perk.astralsorcery.key.reduced_food.name": "大胃王",
  "perk.astralsorcery.key.reduced_food.desc": "減少您對食物的總體需求",
  "perk.astralsorcery.key.place_lights.name": "礦工的喜悅",
  "perk.astralsorcery.key.place_lights.desc": "當你在洞穴中時在附近放置光源",
  "perk.astralsorcery.key.damage_armor.name": "身體阻斷",
  "perk.astralsorcery.key.damage_armor.desc.1": "每穿戴一件盔甲,所受到的傷害 5%%",
  "perk.astralsorcery.key.damage_armor.desc.2": "會直接加到你的盔甲",
  "perk.astralsorcery.key.no_knockback.name": "堅定不移",
  "perk.astralsorcery.key.no_knockback.desc": "你無法被擊退",
  "perk.astralsorcery.key.projectile_close_range.name": "鈍箭",
  "perk.astralsorcery.key.projectile_close_range.desc.1": "用投射物攻擊敵人的距離越近",
  "perk.astralsorcery.key.projectile_close_range.desc.2": "投射物造成的傷害越大。但若是",
  "perk.astralsorcery.key.projectile_close_range.desc.3": "距離太遠，造成的傷害也會變小。",
  "perk.astralsorcery.key.projectile_distance.name": "遠射",
  "perk.astralsorcery.key.projectile_distance.desc.1": "越遠的敵人被投射物擊中，",
  "perk.astralsorcery.key.projectile_distance.desc.2": "造成的傷害越大。如果敵人",
  "perk.astralsorcery.key.projectile_distance.desc.3": "太近，造成的傷害也會變小。",
  "perk.astralsorcery.key.rampage.name": "橫衝直撞",
  "perk.astralsorcery.key.rampage.desc.1": "在擊殺敵人後，",
  "perk.astralsorcery.key.rampage.desc.2": "獲得移動速度，攻擊速度，和傷害加乘。",
  "perk.astralsorcery.key.disarm.name": "無懈可擊",
  "perk.astralsorcery.key.disarm.desc": "攻擊時有機率破防",
  "perk.astralsorcery.key.dig_types.name": "上帝視角",
  "perk.astralsorcery.key.dig_types.desc.1": "可以用鎬來代替",
  "perk.astralsorcery.key.dig_types.desc.2": "斧或鏟",
  "perk.astralsorcery.key.charge_regen.name": "光譜線",
  "perk.astralsorcery.key.charge_regen.desc.1": "星能恢復的速度",
  "perk.astralsorcery.key.charge_regen.desc.2": "在地下或白天時",
  "perk.astralsorcery.key.charge_regen.desc.3": "受到較少的阻礙.",
  "perk.astralsorcery.key.aoe_effect.name": "範圍效果",
  "perk.astralsorcery.key.aoe_effect.desc.1": "橫掃之刃的效果+2等.",
  "perk.astralsorcery.key.aoe_effect.desc.2": "橫掃之刃也適用於遠程攻擊.",
  "perk.astralsorcery.key.enduring.name": "長長久久",
  "perk.astralsorcery.key.enduring.desc.1": "耐久效果+1等",
  "perk.astralsorcery.key.undead_bane.name": "不死之禍",
  "perk.astralsorcery.key.undead_bane.desc.1": "不死剋星效果+1等",
  "perk.astralsorcery.key.endless_munitions.name": "無盡彈藥",
  "perk.astralsorcery.key.endless_munitions.desc.1": "無限效果+1等",
  "perk.astralsorcery.key.void_trash.name": "變廢為寶",
  "perk.astralsorcery.key.void_trash.desc.1": "將所有垃圾掉落物丟進虛空.",
  "perk.astralsorcery.key.void_trash.desc.2": "偶爾能在出產有價值的礦物.",
  "perk.astralsorcery.key.stone_enrichment.name": "點石成金",
  "perk.astralsorcery.key.stone_enrichment.desc.1": "你附近的石頭可能",
  "perk.astralsorcery.key.stone_enrichment.desc.2": "變成更有價值的.",
  "perk.astralsorcery.key.mending.name": "修補",
  "perk.astralsorcery.key.mending.desc": "有時你的盔甲會稍微自我修復.",
  "perk.astralsorcery.key.step_assist.name": "梯雲縱",
  "perk.astralsorcery.key.step_assist.desc": "爬高1格方塊看來更容易了.",
  "perk.astralsorcery.key.magnet_drops.name": "空間操縱",
  "perk.astralsorcery.key.magnet_drops.desc.1": "在挖礦或擊殺怪物時掉落的物品",
  "perk.astralsorcery.key.magnet_drops.desc.2": "將直接轉移到你的背包.",
  "perk.astralsorcery.key.mantle_flight.name": "光譜之翼",
  "perk.astralsorcery.key.mantle_flight.desc.1": "現在虛御座的披風擁有飛行能力",
  "perk.astralsorcery.key.mantle_flight.desc.2": "而不是像鞘翅那樣的滑翔.",
  "perk.astralsorcery.key.thorns_ranged.name": "乾坤大挪移",
  "perk.astralsorcery.key.thorns_ranged.desc": "遠程傷害也會被反彈.",
  "perk.astralsorcery.key.revive.name": "鳳凰守護",
  "perk.astralsorcery.key.revive.desc": "可以在嚴峻的情況下免於死亡.",
  "perk.astralsorcery.key.no_armor.name": "鑽石之膚",
  "perk.astralsorcery.key.no_armor.desc.1": "當所穿的盔甲少於",
  "perk.astralsorcery.key.no_armor.desc.2": "2件時減少至少30%傷害.",
  "perk.astralsorcery.key.damage_types.name": "詛咒之觸",
  "perk.astralsorcery.key.damage_types.desc.1": "增加中毒,凋零或明顯 ",
  "perk.astralsorcery.key.damage_types.desc.2": "消弱敵人的機會.",
  "perk.astralsorcery.key.cull_attack.name": "致命打擊",
  "perk.astralsorcery.key.cull_attack.desc.1": "當擊中生命值低於15%%",
  "perk.astralsorcery.key.cull_attack.desc.2": "的敵人時將直接擊殺.",
  "perk.astralsorcery.key.bleed.name": "流血",
  "perk.astralsorcery.key.bleed.desc.1": "在擊中生物後有機率施加流血效果",
  "perk.astralsorcery.key.bleed.desc.2": "失血期間將造成持續傷害.",
  "perk.astralsorcery.key.arc.name": "閃電弧光鏈",
  "perk.astralsorcery.key.arc.desc.1": "擊生物時有機率",
  "perk.astralsorcery.key.arc.desc.2": "在其與附近的其他怪物間",
  "perk.astralsorcery.key.arc.desc.3": "生成閃電弧光鏈.",
  "perk.astralsorcery.key.low_life.name": "迴光返照",
  "perk.astralsorcery.key.low_life.desc.1": "當你失去越多生命時",
  "perk.astralsorcery.key.low_life.desc.2": "能造成更多的傷害和挖掘速度.",
  "perk.astralsorcery.key.luck.name": "一貫的運氣",
  "perk.astralsorcery.key.luck.desc": "幸運效果+1級.",
  "perk.astralsorcery.key.entity_reach.name": "勤學苦練",
  "perk.astralsorcery.key.entity_reach.desc": "放置方塊的手長的效果也適用於攻擊手長.",

  "perk.astralsorcery.special.focus.gelu.name": "焦點:寒冰座",
  "perk.astralsorcery.special.focus.gelu.desc.1": "每個點亮的星能力獲得額外+2%%的效果.",
  "perk.astralsorcery.special.focus.gelu.desc.2": "其他對星能力效果的修改將無效化.",
  "perk.astralsorcery.special.focus.gelu.desc.3": "",
  "perk.astralsorcery.special.focus.gelu.desc.4": "你只能擁有一個焦點星能力.",
  "perk.astralsorcery.special.focus.ulteria.name": "焦點:避役座",
  "perk.astralsorcery.special.focus.ulteria.desc.1": "每個未點亮的星能力獲得額外+5%%的星能力經驗.",
  "perk.astralsorcery.special.focus.ulteria.desc.2": "",
  "perk.astralsorcery.special.focus.ulteria.desc.3": "你只能擁有一個焦點星能力.",
  "perk.astralsorcery.special.focus.vorux.name": "焦點:貪狼座",
  "perk.astralsorcery.special.focus.vorux.desc.1": "每個點亮的星能力獲得額外+1%%的效果.",
  "perk.astralsorcery.special.focus.vorux.desc.2": "你將無法獲得星能力經驗.",
  "perk.astralsorcery.special.focus.vorux.desc.3": "",
  "perk.astralsorcery.special.focus.vorux.desc.4": "你只能擁有一個焦點星能力.",
  "perk.astralsorcery.special.focus.alcara.name": "焦點:振變座",
  "perk.astralsorcery.special.focus.alcara.desc.1": "星能力經驗增加與減少",
  "perk.astralsorcery.special.focus.alcara.desc.2": "適用於星能力效果.",
  "perk.astralsorcery.special.focus.alcara.desc.3": "",
  "perk.astralsorcery.special.focus.alcara.desc.4": "你只能擁有一個焦點星能力.",

  "perk.astralsorcery.special.connector.evorsio.name": "查克拉的短暫性",
  "perk.astralsorcery.special.connector.discidia.name": "查克拉的貪婪性",
  "perk.astralsorcery.special.connector.armara.name": "查克拉的韌性",
  "perk.astralsorcery.special.connector.vicio.name": "查克拉的靈巧性",
  "perk.astralsorcery.special.connector.aevitas.name": "查克拉的連續性",
  "perk.astralsorcery.special.connector.key.evorsio.name": "頓悟: 短暫性",
  "perk.astralsorcery.special.connector.key.evorsio.desc.1": "其他'頓悟'節點可解鎖",
  "perk.astralsorcery.special.connector.key.evorsio.desc.2": "無須連接到現有的星能力",
  "perk.astralsorcery.special.connector.key.discidia.name": "頓悟: 貪婪性",
  "perk.astralsorcery.special.connector.key.discidia.desc.1": "其他'頓悟'節點可解鎖",
  "perk.astralsorcery.special.connector.key.discidia.desc.2": "無須連接到現有的星能力",
  "perk.astralsorcery.special.connector.key.armara.name": "頓悟: 韌性",
  "perk.astralsorcery.special.connector.key.armara.desc.1": "其他'頓悟'節點可解鎖",
  "perk.astralsorcery.special.connector.key.armara.desc.2": "無須連接到現有的星能力",
  "perk.astralsorcery.special.connector.key.vicio.name": "頓悟: 靈巧性",
  "perk.astralsorcery.special.connector.key.vicio.desc.1": "其他'頓悟'節點可解鎖",
  "perk.astralsorcery.special.connector.key.vicio.desc.2": "無須連接到現有的星能力",
  "perk.astralsorcery.special.connector.key.aevitas.name": "頓悟: 連續性",
  "perk.astralsorcery.special.connector.key.aevitas.desc.1": "其他'頓悟'節點可解鎖",
  "perk.astralsorcery.special.connector.key.aevitas.desc.2": "無須連接到現有的星能力",

  "perk.astralsorcery.special.arc_chain_1.name": "閃電弧光鏈",
  "perk.astralsorcery.special.arc_chain_1.desc": "增加1次閃電弧光鏈",
  "perk.astralsorcery.special.arc_chain_2.name": "閃電弧光鏈",
  "perk.astralsorcery.special.arc_chain_2.desc": "增加2次閃電弧光鏈"
}
